TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_qspi.h
/*
 * Copyright (c) 2020, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*!****************************************************************************
 *  @file       dl_qspi.h
 *  @brief      QSPI Driver Library
 *  @defgroup   QSPI Serial Peripheral Interface (QSPI)
 *
 *  @anchor ti_dl_dl_qspi_Overview
 *  # Overview
 *
 *  The Serial Peripheral Interface Driver Library allows full configuration of
 *  the MSPM33 QSPI module.
 *  The serial peripheral interface (QSPI) module provides a standardized
 *  serial interface to transfer data between MSPM33 devices and other external
 *  devices with QSPI interface.
 *
 *  <hr>
 ******************************************************************************
 */
/** @addtogroup QSPI
 * @{
 */
#ifndef ti_dl_dl_qspi__include
#define ti_dl_dl_qspi__include

#include <stdbool.h>
#include <stdint.h>

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/dl_common.h>

#ifdef __MSP_HAS_QSPI__

#ifdef __cplusplus
extern "C" {
#endif

/* clang-format off */

/** @addtogroup DL_QSPI_CD_MODE
 *  @{
 */
/*!
 * @brief Data mode
 */
#define DL_QSPI_CD_MODE_DATA        (QSPI_CTL1_CDMODE_DATA >> QSPI_CTL1_CDMODE_OFS)

/*!
 * @brief Command mode
 */
#define DL_QSPI_CD_MODE_COMMAND  (QSPI_CTL1_CDMODE_COMMAND >> QSPI_CTL1_CDMODE_OFS)


/** @}*/

/** @addtogroup DL_QSPI_INTERRUPT
 *  @{
 */

/*!
 * @brief DMA done 1 event for transmit interrupt
 */
#define DL_QSPI_INTERRUPT_DMA_DONE_TX    (QSPI_CPU_INT_IMASK_DMA_DONE_TX_SET)

/*!
 * @brief DMA done 1 event for receive interrupt
 */
#define DL_QSPI_INTERRUPT_DMA_DONE_RX    (QSPI_CPU_INT_IMASK_DMA_DONE_RX_SET)
/*!
 * @brief QSPI has finished transfers and changed into idle mode interrupt
 */
#define DL_QSPI_INTERRUPT_IDLE                   (QSPI_CPU_INT_IMASK_IDLE_SET)

/*!
 * @brief Transmit FIFO empty interrupt
 */
#define DL_QSPI_INTERRUPT_TX_EMPTY            (QSPI_CPU_INT_IMASK_TXEMPTY_SET)

/*!
 * @brief Transmit FIFO interrupt
 */
#define DL_QSPI_INTERRUPT_TX                       (QSPI_CPU_INT_IMASK_TX_SET)

/*!
 * @brief Receive FIFO interrupt
 */
#define DL_QSPI_INTERRUPT_RX                       (QSPI_CPU_INT_IMASK_RX_SET)

/*!
 * @brief Receive timeout interrupt
 */
#define DL_QSPI_INTERRUPT_RX_TIMEOUT            (QSPI_CPU_INT_IMASK_RTOUT_SET)

/*!
 * @brief Receive FIFO full interrupt
 */
#define DL_QSPI_INTERRUPT_RX_FULL              (QSPI_CPU_INT_IMASK_RXFULL_SET)

/*!
 * @brief Transmit FIFO underflow interrupt
 */
#define DL_QSPI_INTERRUPT_TX_UNDERFLOW     (QSPI_CPU_INT_IMASK_TXFIFO_UNF_SET)

/*!
 * @brief Parity error
 */
#define DL_QSPI_INTERRUPT_PARITY_ERROR            (QSPI_CPU_INT_IMASK_PER_SET)

/*!
 * @brief Receive FIFO overflow interrupt
 */
#define DL_QSPI_INTERRUPT_RX_OVERFLOW      (QSPI_CPU_INT_IMASK_RXFIFO_OVF_SET)

/** @}*/

/*! @enum DL_QSPI_DMA_IIDX_RX */
typedef enum {
    /*! QSPI interrupt index for enabling QSPI receive as DMA trigger */
    DL_QSPI_DMA_IIDX_RX_TRIGGER = QSPI_DMA_TRIG_RX_IIDX_STAT_RX_EVT,
    /*! QSPI interrupt index for enabling QSPI receive timeout as DMA trigger */
    DL_QSPI_DMA_IIDX_RX_TIMEOUT_TRIGGER = QSPI_DMA_TRIG_RX_IIDX_STAT_RTOUT_EVT
} DL_QSPI_DMA_IIDX_RX;

/*! @enum DL_QSPI_DMA_IIDX_TX */
typedef enum {
    /*! QSPI interrupt index for enabling QSPI transmit as DMA trigger */
    DL_QSPI_DMA_IIDX_TX_TRIGGER = QSPI_DMA_TRIG_TX_IIDX_STAT_TX_EVT
} DL_QSPI_DMA_IIDX_TX;

/** @addtogroup DL_QSPI_DMA_INTERRUPT_RX
 *  @{
 */
/*!
 * @brief QSPI interrupt for enabling QSPI receive as DMA trigger
 */
#define DL_QSPI_DMA_INTERRUPT_RX               (QSPI_DMA_TRIG_RX_IMASK_RX_SET)

/*!
 * @brief QSPI interrupt for enabling QSPI receive timeout as DMA trigger
 */
#define DL_QSPI_DMA_INTERRUPT_RX_TIMEOUT       (QSPI_DMA_TRIG_RX_IMASK_RTOUT_SET)

/** @}*/

/*!
 * @brief QSPI interrupt for enabling QSPI transmit as DMA trigger
 */
#define DL_QSPI_DMA_INTERRUPT_TX               (QSPI_DMA_TRIG_TX_IMASK_TX_SET)

/* clang-format on */

/*! @enum DL_QSPI_PARITY */
typedef enum {
    /*! Use even parity, enable transmit and receive parity */
    DL_QSPI_PARITY_EVEN =
        (QSPI_CTL1_PES_ENABLE | QSPI_CTL1_PREN_ENABLE | QSPI_CTL1_PTEN_ENABLE),
    /*! Use odd parity, enable transmit and receive parity  */
    DL_QSPI_PARITY_ODD =
        (QSPI_CTL1_PES_DISABLE | QSPI_CTL1_PREN_ENABLE | QSPI_CTL1_PTEN_ENABLE),
    /*! Disable receive and transmit parity */
    DL_QSPI_PARITY_NONE = (QSPI_CTL1_PREN_DISABLE | QSPI_CTL1_PTEN_DISABLE)
} DL_QSPI_PARITY;

/*! @enum DL_QSPI_FRAME_FORMAT */
typedef enum {
    /*! Motorola 3 Wire with Polarity 0, Phase 0 */
    DL_QSPI_FRAME_FORMAT_MOTO3_POL0_PHA0 =
        (QSPI_CTL0_SPO_LOW | QSPI_CTL0_SPH_FIRST | QSPI_CTL0_FRF_MOTOROLA_3WIRE),
    /*! Motorola 3 Wire with Polarity 0, Phase 1 */
    DL_QSPI_FRAME_FORMAT_MOTO3_POL0_PHA1 =
        (QSPI_CTL0_SPO_LOW | QSPI_CTL0_SPH_SECOND | QSPI_CTL0_FRF_MOTOROLA_3WIRE),
    /*! Motorola 3 Wire with Polarity 1, Phase 0 */
    DL_QSPI_FRAME_FORMAT_MOTO3_POL1_PHA0 =
        (QSPI_CTL0_SPO_HIGH | QSPI_CTL0_SPH_FIRST | QSPI_CTL0_FRF_MOTOROLA_3WIRE),
    /*! Motorola 3 Wire with Polarity 1, Phase 1 */
    DL_QSPI_FRAME_FORMAT_MOTO3_POL1_PHA1 =
        (QSPI_CTL0_SPO_HIGH | QSPI_CTL0_SPH_SECOND |
            QSPI_CTL0_FRF_MOTOROLA_3WIRE),
    /*! Motorola 4 Wire with Polarity 0, Phase 0 */
    DL_QSPI_FRAME_FORMAT_MOTO4_POL0_PHA0 =
        (QSPI_CTL0_SPO_LOW | QSPI_CTL0_SPH_FIRST | QSPI_CTL0_FRF_MOTOROLA_4WIRE),
    /*! Motorola 4 Wire with Polarity 0, Phase 1 */
    DL_QSPI_FRAME_FORMAT_MOTO4_POL0_PHA1 =
        (QSPI_CTL0_SPO_LOW | QSPI_CTL0_SPH_SECOND | QSPI_CTL0_FRF_MOTOROLA_4WIRE),
    /*! Motorola 4 Wire with Polarity 1, Phase 0 */
    DL_QSPI_FRAME_FORMAT_MOTO4_POL1_PHA0 =
        (QSPI_CTL0_SPO_HIGH | QSPI_CTL0_SPH_FIRST | QSPI_CTL0_FRF_MOTOROLA_4WIRE),
    /*! Motorola 4 Wire with Polarity 1, Phase 1 */
    DL_QSPI_FRAME_FORMAT_MOTO4_POL1_PHA1 =
        (QSPI_CTL0_SPO_HIGH | QSPI_CTL0_SPH_SECOND |
            QSPI_CTL0_FRF_MOTOROLA_4WIRE),
    /*! TI Sync Frame Format */
    DL_QSPI_FRAME_FORMAT_TI_SYNC = (QSPI_CTL0_FRF_TI_SYNC),
} DL_QSPI_FRAME_FORMAT;

/*! @enum DL_QSPI_MODE */
typedef enum {
    /*! Controller mode */
    DL_QSPI_MODE_CONTROLLER = (QSPI_CTL1_CP_ENABLE),
    /*! Peripheral mode */
    DL_QSPI_MODE_PERIPHERAL = (QSPI_CTL1_CP_DISABLE)
} DL_QSPI_MODE;

