TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_qspi.h
typedef enum {
    /*! Direct mode */
    DL_QSPI_PORT_DIRECT = (QSPI_QSPICTL0_QSPIMODE_DIRECT_PORT),
    /*! Indirect mode */
    DL_QSPI_PORT_INDIRECT = (QSPI_QSPICTL0_QSPIMODE_PERIPH_PORT)
} DL_QSPI_PORT;

typedef enum {
    /*! 3 Byte address mode */
    DL_QSPI_ADDRESS_MODE_3BYTE = (QSPI_QSPICTL0_QSPIADDRMODE__3BYTE_ADDR),
    /*! 4 Byte address mode */
    DL_QSPI_ADDRESS_MODE_4BYTE = (QSPI_QSPICTL0_QSPIADDRMODE__4BYTE_ADDR)
} DL_QSPI_ADDRESS_MODE;

typedef enum {
    DL_QSPI_BUS_FORMAT_SPI_FULL_DUPLEX = (QSPI_QSPICTL0_QSPIFORMAT_LEGACY_SPI_FULLDUPLEX),
    DL_QSPI_BUS_FORMAT_SPI_HALF_DUPLEX = (QSPI_QSPICTL0_QSPIFORMAT_SPI_HALFDUPLEX),
    DL_QSPI_BUS_FORMAT_SSS_MODE = (QSPI_QSPICTL0_QSPIFORMAT_SSS_MODE),
    DL_QSPI_BUS_FORMAT_SSD_MODE = (QSPI_QSPICTL0_QSPIFORMAT_SSD_MODE),
    DL_QSPI_BUS_FORMAT_SDD_MODE = (QSPI_QSPICTL0_QSPIFORMAT_SDD_MODE),
    DL_QSPI_BUS_FORMAT_SSQ_MODE = (QSPI_QSPICTL0_QSPIFORMAT_SSQ_MODE),
    DL_QSPI_BUS_FORMAT_SQQ_MODE = (QSPI_QSPICTL0_QSPIFORMAT_SQQ_MODE),
    DL_QSPI_BUS_FORMAT_QQQ_MODE = (QSPI_QSPICTL0_QSPIFORMAT_QQQ_MODE),
} DL_QSPI_BUS_FORMAT;

typedef enum {
    DL_QSPI_WORD_SIZE_8 = (QSPI_QSPICTL0_QSPIDSIZE__8BITDSIZE),
    DL_QSPI_WORD_SIZE_16 = (QSPI_QSPICTL0_QSPIDSIZE__16BITDSIZE),
    DL_QSPI_WORD_SIZE_32 = (QSPI_QSPICTL0_QSPIDSIZE__32BITDSIZE)
} DL_QSPI_WORD_SIZE;

typedef enum {
    DL_QSPI_DATA_SAMPLE_DELAY_0 = (QSPI_QSPITIMING_DATASAMPLDLY_NODELAY),
    DL_QSPI_DATA_SAMPLE_DELAY_1 = (QSPI_QSPITIMING_DATASAMPLDLY__1CLKDELAY)
} DL_QSPI_DATA_SAMPLE_DELAY;

typedef enum {
    DL_QSPI_CHIP_SELECT_ASSERT_DELAY_0P5 = (QSPI_QSPITIMING_CSASSERTDLY__0P5SCLKDELAY),
    DL_QSPI_CHIP_SELECT_ASSERT_DELAY_1P5 = (QSPI_QSPITIMING_CSASSERTDLY__1P5SCLKDELAY)
} DL_QSPI_CHIP_SELECT_ASSERT_DELAY;

typedef enum {
    DL_QSPI_CHIP_SELECT_DEASSERT_DELAY_0P5 = (QSPI_QSPITIMING_CSDEASSERTDLY__0P5SCLKDELAY),
    DL_QSPI_CHIP_SELECT_DEASSERT_DELAY_1P5 = (QSPI_QSPITIMING_CSDEASSERTDLY__1P5SCLKDELAY)
} DL_QSPI_CHIP_SELECT_DEASSERT_DELAY;

/*! @enum DL_QSPI_BIT_ORDER */
typedef enum {
    /*! MSB First */
    DL_QSPI_BIT_ORDER_MSB_FIRST = (QSPI_CTL1_MSB_ENABLE),
    /*! LSB First */
    DL_QSPI_BIT_ORDER_LSB_FIRST = (QSPI_CTL1_MSB_DISABLE)
} DL_QSPI_BIT_ORDER;

/*! @enum DL_QSPI_DATA_SIZE */
typedef enum {
    /*! Data size 4 bits */
    DL_QSPI_DATA_SIZE_4 = (QSPI_CTL0_DSS_DSS_4),
    /*! Data size 5 bits */
    DL_QSPI_DATA_SIZE_5 = (QSPI_CTL0_DSS_DSS_5),
    /*! Data size 6 bits */
    DL_QSPI_DATA_SIZE_6 = (QSPI_CTL0_DSS_DSS_6),
    /*! Data size 7 bits */
    DL_QSPI_DATA_SIZE_7 = (QSPI_CTL0_DSS_DSS_7),
    /*! Data size 8 bits */
    DL_QSPI_DATA_SIZE_8 = (QSPI_CTL0_DSS_DSS_8),
    /*! Data size 9 bits */
    DL_QSPI_DATA_SIZE_9 = (QSPI_CTL0_DSS_DSS_9),
    /*! Data size 10 bits */
    DL_QSPI_DATA_SIZE_10 = (QSPI_CTL0_DSS_DSS_10),
    /*! Data size 11 bits */
    DL_QSPI_DATA_SIZE_11 = (QSPI_CTL0_DSS_DSS_11),
    /*! Data size 12 bits */
    DL_QSPI_DATA_SIZE_12 = (QSPI_CTL0_DSS_DSS_12),
    /*! Data size 13 bits */
    DL_QSPI_DATA_SIZE_13 = (QSPI_CTL0_DSS_DSS_13),
    /*! Data size 14 bits */
    DL_QSPI_DATA_SIZE_14 = (QSPI_CTL0_DSS_DSS_14),
    /*! Data size 15 bits */
    DL_QSPI_DATA_SIZE_15 = (QSPI_CTL0_DSS_DSS_15),
    /*! Data size 16 bits */
    DL_QSPI_DATA_SIZE_16 = (QSPI_CTL0_DSS_DSS_16),
} DL_QSPI_DATA_SIZE;

/*! @enum DL_QSPI_CHIP_SELECT */
typedef enum {
    /*! Chip Select 0 */
    DL_QSPI_CHIP_SELECT_0 = (QSPI_CTL0_CSSEL_CSSEL_0),
    /*! Chip Select 1 */
    DL_QSPI_CHIP_SELECT_1 = (QSPI_CTL0_CSSEL_CSSEL_1),
    /*! Chip Select 2 */
    DL_QSPI_CHIP_SELECT_2 = (QSPI_CTL0_CSSEL_CSSEL_2),
    /*! Chip Select 3 */
    DL_QSPI_CHIP_SELECT_3 = (QSPI_CTL0_CSSEL_CSSEL_3),
    /*! No chip select */
    DL_QSPI_CHIP_SELECT_NONE = (0)
} DL_QSPI_CHIP_SELECT;

/*! @enum DL_QSPI_TX_FIFO_LEVEL */
typedef enum {
    /*! Interrupt triggers when TX FIFO <= 3/4 empty */
    DL_QSPI_TX_FIFO_LEVEL_3_4_EMPTY = QSPI_IFLS_TXIFLSEL_LVL_3_4,
    /*! Interrupt triggers when TX FIFO <= 1/2 empty (default) */
    DL_QSPI_TX_FIFO_LEVEL_1_2_EMPTY = QSPI_IFLS_TXIFLSEL_LVL_1_2,
    /*! Interrupt triggers when TX FIFO <= 1/4 empty */
    DL_QSPI_TX_FIFO_LEVEL_1_4_EMPTY = QSPI_IFLS_TXIFLSEL_LVL_1_4,
    /*! Interrupt triggers when TX FIFO is empty */
    DL_QSPI_TX_FIFO_LEVEL_EMPTY = QSPI_IFLS_TXIFLSEL_LVL_EMPTY,
    /*! Interrupt triggers when TX FIFO has >= 1 frame free. Should be used with DMA */
    DL_QSPI_TX_FIFO_LEVEL_ONE_FRAME = QSPI_IFLS_TXIFLSEL_LEVEL_1,
    DL_QSPI_TX_FIFO_LEVEL_RES4 = QSPI_IFLS_TXIFLSEL_LVL_RES4,
    DL_QSPI_TX_FIFO_LEVEL_RES6 = QSPI_IFLS_TXIFLSEL_LVL_RES6,
    DL_QSPI_TX_FIFO_LEVEL_OFF = QSPI_IFLS_TXIFLSEL_LVL_OFF
} DL_QSPI_TX_FIFO_LEVEL;

/*! @enum DL_QSPI_RX_FIFO_LEVEL */
typedef enum {
    /*! Interrupt triggers when RX FIFO contains >= 1 frame. Should be used with DMA */
    DL_QSPI_RX_FIFO_LEVEL_ONE_FRAME = QSPI_IFLS_RXIFLSEL_LEVEL_1,
    /*! Interrupt triggers when RX FIFO is full */
    DL_QSPI_RX_FIFO_LEVEL_FULL = QSPI_IFLS_RXIFLSEL_LVL_FULL,
    /*! Interrupt triggers when RX FIFO >= 3/4 full */
    DL_QSPI_RX_FIFO_LEVEL_3_4_FULL = QSPI_IFLS_RXIFLSEL_LVL_3_4,
    /*! Interrupt triggers when RX FIFO >= 1/2 full (default) */
    DL_QSPI_RX_FIFO_LEVEL_1_2_FULL = QSPI_IFLS_RXIFLSEL_LVL_1_2,
    /*! Interrupt triggers when RX FIFO >= 1/4 full */
    DL_QSPI_RX_FIFO_LEVEL_1_4_FULL = QSPI_IFLS_RXIFLSEL_LVL_1_4,
    DL_QSPI_RX_FIFO_LEVEL_RES4 = QSPI_IFLS_RXIFLSEL_LVL_RES4,
    DL_QSPI_RX_FIFO_LEVEL_RES6 = QSPI_IFLS_RXIFLSEL_LVL_RES6,
    DL_QSPI_RX_FIFO_LEVEL_OFF = QSPI_IFLS_RXIFLSEL_LVL_OFF
} DL_QSPI_RX_FIFO_LEVEL;

/*! @enum DL_QSPI_IIDX */
typedef enum {

    /*! QSPI interrupt index for DMA Done 1 event for transmit */
    DL_QSPI_IIDX_DMA_DONE_TX = QSPI_CPU_INT_IIDX_STAT_DMA_DONE_TX_EVT,
    /*! QSPI interrupt index for DMA Done 1 event for receive */
    DL_QSPI_IIDX_DMA_DONE_RX = QSPI_CPU_INT_IIDX_STAT_DMA_DONE_RX_EVT,
    /*! QSPI interrupt index for QSPI to signal it has finished transfers and
     * changed into idle mode */

    DL_QSPI_IIDX_IDLE = QSPI_CPU_INT_IIDX_STAT_IDLE_EVT,
    /*! QSPI interrupt index for transmit FIFO empty */
    DL_QSPI_IIDX_TX_EMPTY = QSPI_CPU_INT_IIDX_STAT_TX_EMPTY,
    /*! QSPI interrupt index for transmit FIFO */
    DL_QSPI_IIDX_TX = QSPI_CPU_INT_IIDX_STAT_TX_EVT,
    /*! QSPI interrupt index for receive FIFO */
    DL_QSPI_IIDX_RX = QSPI_CPU_INT_IIDX_STAT_RX_EVT,
    /*! QSPI interrupt index for receive timeout */
    DL_QSPI_IIDX_RX_TIMEOUT = QSPI_CPU_INT_IIDX_STAT_RTOUT_EVT,

