TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_qspi.h
    /*! QSPI interrupt index for receive FIFO full  */
    DL_QSPI_IIDX_RX_FULL = QSPI_CPU_INT_IIDX_STAT_RXFULL_EVT,
    /*! QSPI interrupt index for transmit FIFO underflow  */
    DL_QSPI_IIDX_TX_UNDERFLOW = QSPI_CPU_INT_IIDX_STAT_TXFIFO_UNF_EVT,

    /*! QSPI interrupt index for parity error */
    DL_QSPI_IIDX_PARITY_ERROR = QSPI_CPU_INT_IIDX_STAT_PER_EVT,
    /*! QSPI interrupt index for receive FIFO overflow */
    DL_QSPI_IIDX_RX_OVERFLOW = QSPI_CPU_INT_IIDX_STAT_RXFIFO_OFV_EVT
} DL_QSPI_IIDX;

/*! @enum DL_QSPI_CLOCK_DIVIDE_RATIO */
typedef enum {
    /*! QSPI source clock divide ratio set to 1 */
    DL_QSPI_CLOCK_DIVIDE_RATIO_1 = QSPI_CLKDIV_RATIO_DIV_BY_1,
    /*! QSPI source clock divide ratio set to 2 */
    DL_QSPI_CLOCK_DIVIDE_RATIO_2 = QSPI_CLKDIV_RATIO_DIV_BY_2,
    /*! QSPI source clock divide ratio set to 3 */
    DL_QSPI_CLOCK_DIVIDE_RATIO_3 = QSPI_CLKDIV_RATIO_DIV_BY_3,
    /*! QSPI source clock divide ratio set to 4 */
    DL_QSPI_CLOCK_DIVIDE_RATIO_4 = QSPI_CLKDIV_RATIO_DIV_BY_4,
    /*! QSPI source clock divide ratio set to 5 */
    DL_QSPI_CLOCK_DIVIDE_RATIO_5 = QSPI_CLKDIV_RATIO_DIV_BY_5,
    /*! QSPI source clock divide ratio set to 6 */
    DL_QSPI_CLOCK_DIVIDE_RATIO_6 = QSPI_CLKDIV_RATIO_DIV_BY_6,
    /*! QSPI source clock divide ratio set to 7 */
    DL_QSPI_CLOCK_DIVIDE_RATIO_7 = QSPI_CLKDIV_RATIO_DIV_BY_7,
    /*! QSPI source clock divide ratio set to 8 */
    DL_QSPI_CLOCK_DIVIDE_RATIO_8 = QSPI_CLKDIV_RATIO_DIV_BY_8
} DL_QSPI_CLOCK_DIVIDE_RATIO;

/*! @enum DL_QSPI_CLOCK */
typedef enum {
    /*! Selects BUSCLK as the clock source */
    DL_QSPI_CLOCK_BUSCLK = QSPI_CLKSEL_SYSCLK_SEL_ENABLE,
    /*! Selects MFCLK as the clock source */
    DL_QSPI_CLOCK_MFCLK = QSPI_CLKSEL_MFCLK_SEL_ENABLE,
    /*! Selects LFCLK as the clock source */
    DL_QSPI_CLOCK_LFCLK = QSPI_CLKSEL_LFCLK_SEL_ENABLE
} DL_QSPI_CLOCK;

/*!
 *  @brief  Configuration struct for @ref DL_QSPI_init.
 */
typedef struct {
    /*! The controller/peripheral mode configuration. One of @ref DL_QSPI_MODE */
    DL_QSPI_MODE mode;

    /*!
     *  The frame format to use for data transfer. One of @ref
     *  DL_QSPI_FRAME_FORMAT
     */
    DL_QSPI_FRAME_FORMAT frameFormat;

    /*!
     *  The parity configuration to use for data transfer. One of @ref
     *  DL_QSPI_PARITY.
     */
    DL_QSPI_PARITY parity;

    /*! The size of the data transfer. One of @ref DL_QSPI_DATA_SIZE */
    DL_QSPI_DATA_SIZE dataSize;

    /*! The order of bits during data transfer. One of @ref DL_QSPI_BIT_ORDER */
    DL_QSPI_BIT_ORDER bitOrder;

    /*! The pin to use for chip select. Used in Controller or Peripheral modes
     *  with Motorola 4-Wire or TI Sync frame formats. One of
     *  @ref DL_QSPI_CHIP_SELECT.
     */
    DL_QSPI_CHIP_SELECT chipSelectPin;

} DL_QSPI_Config;

/*!
 *  @brief  Configuration struct for @ref DL_QSPI_setClockConfig.
 */
typedef struct {
    /*! Selects QSPI module clock source @ref DL_QSPI_CLOCK */
    DL_QSPI_CLOCK clockSel;

    /*! Selects the divide ratio. One of @ref DL_QSPI_CLOCK_DIVIDE_RATIO */
    DL_QSPI_CLOCK_DIVIDE_RATIO divideRatio;

} DL_QSPI_ClockConfig;

/**
 * @brief Configuration structure to backup QSPI peripheral state before going
 *        to STOP/STANDBY mode. Not required after PG 1.0 silicon. Used by
 *        @ref DL_QSPI_saveConfiguration and @ref DL_QSPI_restoreConfiguration
 */
typedef struct {
    /*! Combination of basic QSPI control configurations that are
     *  compressed to a single word as they are stored in the QSPI
     *  registers See @ref DL_QSPI_init for how the peripheral control word 0
     *  is created. */
    uint32_t controlWord0;

    /*! Combination of basic QSPI control configurations that are
     *  compressed to a single word as they are stored in the QSPI
     *  registers. See @ref DL_QSPI_init for how the peripheral control word 1
     *  is created. */
    uint32_t controlWord1;

    /*! Combination of serial clock divider and delayed sampling settings
     *  compressed to a single word as they are stored in the QSPI registers. */
    uint32_t clockControl;

    /*! QSPI module clock source. One of  @ref DL_QSPI_CLOCK */
    uint32_t clockSel;

    /*! QSPI clock divider. One of @ref DL_QSPI_CLOCK_DIVIDE_RATIO */
    uint32_t divideRatio;

    /*! Combination of QSPI interrupt FIFO level select configurations that are
     *  compressed to a single word as they are stored in the QSPI
     *  registers. */
    uint32_t interruptFifoLevelSelectWord;

    /*! QSPI interrupt status for EVENT0.
     *  Bitwise OR of @ref DL_QSPI_INTERRUPT */
    uint32_t interruptMask0;

    /*! QSPI interrupt status for EVENT1.
     *  Bitwise OR of @ref DL_QSPI_DMA_INTERRUPT_RX */
    uint32_t interruptMask1;

    /*! QSPI interrupt status for EVENT2.
     *  Bitwise OR of @ref DL_QSPI_DMA_INTERRUPT_TX */
    uint32_t interruptMask2;

    /*! Boolean flag indicating whether or not a valid configuration structure
     *  exists. Should not be modified by the user. */
    bool backupRdy;
} DL_QSPI_backupConfig;

/**
 *  @brief      Initialize the QSPI peripheral
 *
 *  Initializes all the common configurable options for the QSPI peripheral. Any
 *  other custom configuration can be done after calling this API. The QSPI is
 *  not enabled in this API.
 *
 *  @param[in]  qspi     Pointer to the register overlay for the peripheral
 *  @param[in]  config  Configuration for QSPI peripheral
 */
void DL_QSPI_init(QSPI_Regs *qspi, DL_QSPI_Config *config);

/**
 * @brief Enables power on QSPI module
 *
 * @param qspi        Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_QSPI_enablePower(QSPI_Regs *qspi)
{
    qspi->GPRCM.PWREN = (QSPI_PWREN_KEY_UNLOCK_W | QSPI_PWREN_ENABLE_ENABLE);
}

/**
 * @brief Disables power on qspi module
 *
 * @param qspi        Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_QSPI_disablePower(QSPI_Regs *qspi)
{
    qspi->GPRCM.PWREN = (QSPI_PWREN_KEY_UNLOCK_W | QSPI_PWREN_ENABLE_DISABLE);
}

/**
 * @brief Returns if  power on qspi module
 *
 * @param qspi        Pointer to the register overlay for the peripheral
 *
 * @return true if power is enabled
 * @return false if power is disabled
 */
__STATIC_INLINE bool DL_QSPI_isPowerEnabled(QSPI_Regs *qspi)
{
    return (
        (qspi->GPRCM.PWREN & QSPI_PWREN_ENABLE_MASK) == QSPI_PWREN_ENABLE_ENABLE);
}

/**
 * @brief Resets qspi peripheral
 *
 * @param qspi        Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_QSPI_reset(QSPI_Regs *qspi)
{
    qspi->GPRCM.RSTCTL =
        (QSPI_RSTCTL_KEY_UNLOCK_W | QSPI_RSTCTL_RESETSTKYCLR_CLR |
            QSPI_RSTCTL_RESETASSERT_ASSERT);
}

/**
 * @brief Returns if qspi peripheral was reset
 *
 * @param qspi        Pointer to the register overlay for the peripheral
 *
 * @return true if peripheral was reset
 * @return false if peripheral wasn't reset
 *
 */
__STATIC_INLINE bool DL_QSPI_isReset(QSPI_Regs *qspi)
{
    return ((qspi->GPRCM.STAT & QSPI_GPRCM_STAT_RESETSTKY_MASK) ==
            QSPI_GPRCM_STAT_RESETSTKY_RESET);
}

/**
 *  @brief      Enable the QSPI peripheral
 *
 *  @param[in]  qspi  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_QSPI_enable(QSPI_Regs *qspi)
{
    qspi->CTL1 |= QSPI_CTL1_ENABLE_ENABLE;
}

/**
 *  @brief      Checks if the QSPI peripheral is enabled
 *
 *  @param[in]  qspi  Pointer to the register overlay for the peripheral
 *
 *  @return     Returns the enabled status of the QSPI
 *
 *  @retval     true  The QSPI peripheral is enabled
 *  @retval     false The QSPI peripheral is disabled
 */
__STATIC_INLINE bool DL_QSPI_isEnabled(QSPI_Regs *qspi)
{
    return ((qspi->CTL1 & QSPI_CTL1_ENABLE_MASK) == QSPI_CTL1_ENABLE_ENABLE);
}

/**
 *  @brief      Disable the QSPI peripheral
 *
 *  @param[in]  qspi  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_QSPI_disable(QSPI_Regs *qspi)
{
    qspi->CTL1 &= ~(QSPI_CTL1_ENABLE_MASK);
}

/**
 *  @brief      Configure QSPI source clock
 *
 *  @param[in]  qspi    Pointer to the register overlay for the
 *                      peripheral
 *  @param[in]  config  Pointer to the clock configuration struct
 *                       @ref DL_QSPI_ClockConfig.
 */
void DL_QSPI_setClockConfig(QSPI_Regs *qspi, DL_QSPI_ClockConfig *config);

/**
 *  @brief      Get QSPI source clock configuration
 *
 *  @param[in]  qspi    Pointer to the register overlay for the
 *                      peripheral
 *  @param[in]  config  Pointer to the clock configuration struct
 *                      @ref DL_QSPI_ClockConfig.
 */
void DL_QSPI_getClockConfig(QSPI_Regs *qspi, DL_QSPI_ClockConfig *config);

/**
 *  @brief      Checks if the QSPI is busy transmitting
 *
 *  @param[in]  qspi  Pointer to the register overlay for the peripheral
 *
 *  @return     Returns the busy status of the QSPI
 *
 *  @retval     true  The QSPI is transmitting
 *  @retval     false The QSPI is idle
 */
__STATIC_INLINE bool DL_QSPI_isBusy(QSPI_Regs *qspi)
{
    return ((qspi->STAT & QSPI_STAT_BUSY_MASK) == QSPI_STAT_BUSY_ACTIVE);
}

/**
 *  @brief      Checks if the TX FIFO is empty
 *
 *  @param[in]  qspi  Pointer to the register overlay for the peripheral
 *
 *  @return     Returns the empty status of the TX FIFO
 *
 *  @retval     true  The TX FIFO is empty
 *  @retval     false The TX FIFO is not empty
 */
__STATIC_INLINE bool DL_QSPI_isTXFIFOEmpty(QSPI_Regs *qspi)
{
    return ((qspi->STAT & QSPI_STAT_TFE_MASK) == QSPI_STAT_TFE_EMPTY);
}

/**
 *  @brief      Checks if the TX FIFO is full
 *
 *  @param[in]  qspi  Pointer to the register overlay for the peripheral
 *
 *  @return     Returns the full status of the TX FIFO
 *
 *  @retval     true  The TX FIFO is full
 *  @retval     false The TX FIFO is not full
 */
__STATIC_INLINE bool DL_QSPI_isTXFIFOFull(QSPI_Regs *qspi)
{
    return ((qspi->STAT & QSPI_STAT_TNF_MASK) == QSPI_STAT_TNF_FULL);
}

/**
 *  @brief      Checks if the RX FIFO is empty
 *
 *  @param[in]  qspi  Pointer to the register overlay for the peripheral
 *
 *  @return     Returns the empty status of the RX FIFO
 *
 *  @retval     true  The RX FIFO is empty
 *  @retval     false The RX FIFO is not empty
 */
__STATIC_INLINE bool DL_QSPI_isRXFIFOEmpty(QSPI_Regs *qspi)
{
    return ((qspi->STAT & QSPI_STAT_RFE_MASK) == QSPI_STAT_RFE_EMPTY);
}

/**
 *  @brief      Checks if the RX FIFO is full
 *
 *  @param[in]  qspi  Pointer to the register overlay for the peripheral
 *
 *  @return     Returns the full status of the RX FIFO
 *
 *  @retval     true  The RX FIFO is full
 *  @retval     false The RX FIFO is not full
 */
__STATIC_INLINE bool DL_QSPI_isRXFIFOFull(QSPI_Regs *qspi)
{
    return ((qspi->STAT & QSPI_STAT_RNF_MASK) == QSPI_STAT_RNF_FULL);
}

/**
 *  @brief      Sets the parity configuration used for transactions
 *
 *  This API sets the configuration for both receive parity and transmit parity.
 *  This includes which bit is used, and whether even or odd parity is set.
 *
 *  To individually enable or dsiable the receive or transmit parity, refer to
 *  the APIs listed below.
 *
 *  @param[in]  qspi     Pointer to the register overlay for the peripheral
 *  @param[in]  parity  Parity configuration to use. One of @ref DL_QSPI_PARITY.
 *
 *  @sa         DL_QSPI_init
 *  @sa         DL_QSPI_enableReceiveParity
 *  @sa         DL_QSPI_disableReceiveParity
 *  @sa         DL_QSPI_enableTransmitParity
 *  @sa         DL_QSPI_disableTransmitParity
 */
__STATIC_INLINE void DL_QSPI_setParity(QSPI_Regs *qspi, DL_QSPI_PARITY parity)
{
    DL_Common_updateReg(&qspi->CTL1, (uint32_t) parity,
        (QSPI_CTL1_PREN_MASK | QSPI_CTL1_PTEN_MASK | QSPI_CTL1_PES_MASK));
}

/**
 *  @brief      Get the current receive and transmit parity configuration
 *
 *  @param[in]  qspi  Pointer to the register overlay for the peripheral
 *
 *  @return     The current parity configuration being used
 *
 *  @retval     One of @ref DL_QSPI_PARITY
 */
__STATIC_INLINE DL_QSPI_PARITY DL_QSPI_getParity(QSPI_Regs *qspi)
{
    uint32_t parity = qspi->CTL1 & (QSPI_CTL1_PES_MASK | QSPI_CTL1_PREN_MASK |
                                      QSPI_CTL1_PTEN_MASK);

    return (DL_QSPI_PARITY)(parity);
}

/**
 *  @brief      Enables receive parity
 *
 *  This API only enables receive parity, it does not configure the parity mode
 *  used.
 *
 *  @param[in]  qspi  pointer to the register overlay for the peripheral
 *
 *  @sa         DL_QSPI_setParity
 */
__STATIC_INLINE void DL_QSPI_enableReceiveParity(QSPI_Regs *qspi)
{
    qspi->CTL1 |= QSPI_CTL1_PREN_ENABLE;
}

/**
 *  @brief      Disables receive parity
 *
 *  This API only disable receive parity, it does not configure the parity mode
 *  used.
 *
 *  @param[in]  qspi  pointer to the register overlay for the peripheral
 *
 *  @sa         DL_QSPI_setParity
 */
__STATIC_INLINE void DL_QSPI_disableReceiveParity(QSPI_Regs *qspi)
{
    qspi->CTL1 &= ~(QSPI_CTL1_PREN_MASK);
}

/**
 *  @brief      Checks if receive parity is enabled
 *
 *  @param[in]  qspi  pointer to the register overlay for the peripheral
 *
 *  @return     If receive parity is enabled
 *
 *  @retval     true   Receive parity is enabled
 *  @retval     false  Receive parity is disabled
 */
__STATIC_INLINE bool DL_QSPI_isReceiveParityEnabled(QSPI_Regs *qspi)
{
    return ((qspi->CTL1 & QSPI_CTL1_PREN_MASK) == QSPI_CTL1_PREN_ENABLE);
}

/**
 *  @brief      Enables transmit parity
 *
 *  This API only enables transmit parity, it does not configure the parity mode
 *  used.
 *
 *  @param[in]  qspi  pointer to the register overlay for the peripheral
 *
 *  @sa         DL_QSPI_setParity
 */
__STATIC_INLINE void DL_QSPI_enableTransmitParity(QSPI_Regs *qspi)
{
    qspi->CTL1 |= QSPI_CTL1_PTEN_ENABLE;
}

/**
 *  @brief      Disables transmit parity
 *
 *  This API only disables transmit parity, it does not configure the parity
 *  mode used.
 *
 *  @param[in]  qspi  pointer to the register overlay for the peripheral
 *
 *  @sa         DL_QSPI_setParity
 */
__STATIC_INLINE void DL_QSPI_disableTransmitParity(QSPI_Regs *qspi)
{
    qspi->CTL1 &= ~(QSPI_CTL1_PTEN_MASK);
}

/**
 *  @brief      Checks if transmit parity is enabled
 *
 *  @param[in]  qspi  pointer to the register overlay for the peripheral
 *
 *  @return     If transmit parity is enabled
 *
 *  @retval     true   Transmit parity is enabled
 *  @retval     false  Transmit parity is disabled
 */
__STATIC_INLINE bool DL_QSPI_isTransmitParityEnabled(QSPI_Regs *qspi)
{
    return ((qspi->CTL1 & QSPI_CTL1_PTEN_MASK) == QSPI_CTL1_PTEN_ENABLE);
}

/**
 *  @brief      Set the frame format to use
 *
 *  Configures the frame format to use for transactions. If you are using chip
 *  select you must use one of the Motorola 4 wire frame formats.
 *
 *  @param[in]  qspi          Pointer to the register overlay for the peripheral
 *  @param[in]  frameFormat  Frame format to use. One of @ref
 *                           DL_QSPI_FRAME_FORMAT.
 *
 *  @sa         DL_QSPI_init
 */
__STATIC_INLINE void DL_QSPI_setFrameFormat(
    QSPI_Regs *qspi, DL_QSPI_FRAME_FORMAT frameFormat)
{
    DL_Common_updateReg(&qspi->CTL0, (uint32_t) frameFormat,
        (QSPI_CTL0_FRF_MASK | QSPI_CTL0_SPO_MASK | QSPI_CTL0_SPH_MASK));
}

/**
 *  @brief      Get the frame format configuration
 *
 *  @param[in]  qspi  Pointer to the register overlay for the peripheral
 *
 *  @return     The current frame format being used
 *
 *  @retval     One of @ref DL_QSPI_FRAME_FORMAT
 */
__STATIC_INLINE DL_QSPI_FRAME_FORMAT DL_QSPI_getFrameFormat(QSPI_Regs *qspi)
{
    uint32_t frameFormat = qspi->CTL0 & (QSPI_CTL0_FRF_MASK | QSPI_CTL0_SPO_MASK |
                                           QSPI_CTL0_SPH_MASK);

    return (DL_QSPI_FRAME_FORMAT)(frameFormat);
}

/**
 *  @brief      Set the size for transfers
 *
 *  @param[in]  qspi       Pointer to the register overlay for the peripheral
 *  @param[in]  dataSize  Number of bits used in a transfer.
 *                        One of @ref DL_QSPI_DATA_SIZE
 *
 *  @sa         DL_QSPI_init
 */
__STATIC_INLINE void DL_QSPI_setDataSize(
    QSPI_Regs *qspi, DL_QSPI_DATA_SIZE dataSize)
{
    DL_Common_updateReg(&qspi->CTL0, (uint32_t) dataSize, QSPI_CTL0_DSS_MASK);
}

/**
 *  @brief      Get the configured size for transfers
 *
 *  @param[in]  qspi  Pointer to the register overlay for the peripheral
 *
 *  @return     The currently configured size for transfers
 *
 *  @retval     One of @ref DL_QSPI_DATA_SIZE
 */
__STATIC_INLINE DL_QSPI_DATA_SIZE DL_QSPI_getDataSize(QSPI_Regs *qspi)
{
    uint32_t dataSize = qspi->CTL0 & QSPI_CTL0_DSS_MASK;

