TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_qspi.h
    return (DL_QSPI_DATA_SIZE)(dataSize);
}

/**
 *  @brief      Set whether the device should be in controller/peripheral mode
 *
 *  @param[in]  qspi   Pointer to the register overlay for the peripheral
 *  @param[in]  mode  Mode to configure the QSPI into. One of @ref DL_QSPI_MODE.
 *
 *  @sa         DL_QSPI_init
 */
__STATIC_INLINE void DL_QSPI_setMode(QSPI_Regs *qspi, DL_QSPI_MODE mode)
{
    DL_Common_updateReg(&qspi->CTL1, QSPI_CTL1_CP_ENABLE, QSPI_CTL1_CP_MASK);
}

/**
 *  @brief      Get the current mode for the QSPI (controller/peripheral)
 *
 *  @param[in]  qspi  Pointer to the register overlay for the peripheral
 *
 *  @return     The currently configured mode for the QSPI (controller/peripheral)
 *
 *  @retval     One of @ref DL_QSPI_MODE.
 */
__STATIC_INLINE DL_QSPI_MODE DL_QSPI_getMode(QSPI_Regs *qspi)
{
    uint32_t mode = qspi->CTL1 & QSPI_CTL1_CP_MASK;

    return (DL_QSPI_MODE)(mode);
}

/**
 *  @brief      Set the bit order used for transfers
 *
 *  @param[in]  qspi       Pointer to the register overlay for the peripheral
 *  @param[in]  bitOrder  Order for bits to be sent out during transfer. One of
 *                        @ref DL_QSPI_BIT_ORDER.
 *
 *  @sa         DL_QSPI_init
 */
__STATIC_INLINE void DL_QSPI_setBitOrder(
    QSPI_Regs *qspi, DL_QSPI_BIT_ORDER bitOrder)
{
    DL_Common_updateReg(&qspi->CTL1, (uint32_t) bitOrder, QSPI_CTL1_MSB_MASK);
}

/**
 *  @brief      Get the current bit order used for transfers
 *
 *  @param[in]  qspi  Pointer to the register overlay for the peripheral
 *
 *  @return     The currently configured bit order
 *
 *  @retval     One of @ref DL_QSPI_BIT_ORDER.
 */
__STATIC_INLINE DL_QSPI_BIT_ORDER DL_QSPI_getBitOrder(QSPI_Regs *qspi)
{
    uint32_t bitOrder = qspi->CTL1 & QSPI_CTL1_MSB_MASK;

    return (DL_QSPI_BIT_ORDER)(bitOrder);
}

/**
 *  @brief      Enables loopback mode
 *
 *  Enables the loopback mode. When enabled, the output of the transmit serial
 *  shifter is connected to the input of the receive serial shifter internally.
 *
 *  @param[in]  qspi  pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_QSPI_enableLoopbackMode(QSPI_Regs *qspi)
{
    qspi->CTL1 |= QSPI_CTL1_LBM_ENABLE;
}

/**
 *  @brief      Disables loopback mode
 *
 *  Disables the loopback mode. When disabled, the transmit serial shifter and
 *  receive serial shifter are not connected internally.
 *
 *  @param[in]  qspi  pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_QSPI_disableLoopbackMode(QSPI_Regs *qspi)
{
    qspi->CTL1 &= ~(QSPI_CTL1_LBM_MASK);
}

/**
 *  @brief      Checks if the loopback mode is enabled
 *
 *  @param[in]  qspi  pointer to the register overlay for the peripheral
 *
 *  @return     The status of the loopback mode
 *
 *  @retval     true if loopback mode is enabled
 *  @retval     false if loopback mode is disabled
 */
__STATIC_INLINE bool DL_QSPI_isLoopbackModeEnabled(QSPI_Regs *qspi)
{
    return ((qspi->CTL1 & QSPI_CTL1_LBM_MASK) == QSPI_CTL1_LBM_ENABLE);
}

/**
 *  @brief      Set counter for repeated transmit
 *
 *  Repeated transmit allows you to send the same data multiple times. This is
 *  essentially the same as writing the data into the transmit buffer
 *  repeatedly.
 *
 *  @param[in]  qspi         pointer to the register overlay for the peripheral
 *  @param[in]  numRepeats  number of times to repeat the transfer. Should be a
 *                          value between 0-255.
 *                          @arg 0 disables the repeated transfer
 *                          @arg 1-255 repeats that many times. So will be sent
 *                               numRepeats + 1 times in total.
 */
__STATIC_INLINE void DL_QSPI_setRepeatTransmit(
    QSPI_Regs *qspi, uint32_t numRepeats)
{
    DL_Common_updateReg(&qspi->CTL1, numRepeats << QSPI_CTL1_REPEATTX_OFS,
        QSPI_CTL1_REPEATTX_MASK);
}

/**
 *  @brief      Get counter for repeated transmit
 *
 *  Repeated transmit allows you to send the same data multiple times. This is
 *  essentially the same as writing the data into the transmit buffer
 *  repeatedly.
 *
 *  @param[in]  qspi    pointer to the register overlay for the peripheral
 *
 *  @return     Number of repeats used for transfer
 *
 *  @retval     0      Repeated transfer is disabled
 *  @retval     1-255  Repeat that many times.
 */
__STATIC_INLINE uint32_t DL_QSPI_getRepeatTransmit(QSPI_Regs *qspi)
{
    return ((qspi->CTL1 & QSPI_CTL1_REPEATTX_MASK) >> QSPI_CTL1_REPEATTX_OFS);
}

/**
 *  @brief      Enables data alignment on chip select for peripherals
 *
 *  When enabled, the receieve bit counter is cleared automatically when the
 *  chip select gets set inactive. This helps the peripheral synchronize again to
 *  the controller in case of a disturbance or glitch on the clock line or during
 *  initialization.
 *
 *  This is only relevant when in peripheral mode.
 *
 *  @param[in]  qspi  pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_QSPI_enablePeripheralAlignDataOnChipSelect(
    QSPI_Regs *qspi)
{
    qspi->CTL0 |= QSPI_CTL0_CSCLR_ENABLE;
}

/**
 *  @brief      Disables data alignment on chip select for peripherals
 *
 *  When disable, the receieve bit counter is not cleared automatically when
 *  the chip select gets set inactive.
 *
 *  This is only relevant when in peripheral mode.
 *
 *  @param[in]  qspi  pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_QSPI_disablePeripheralAlignDataOnChipSelect(
    QSPI_Regs *qspi)
{
    qspi->CTL0 &= ~(QSPI_CTL0_CSCLR_MASK);
}

/**
 *  @brief      Checks if data alignment on chip select for peripherals is enabled
 *
 *  @param[in]  qspi  pointer to the register overlay for the peripheral
 *
 *  @return     The status of data alignment on chip select
 *
 *  @retval     true   Data alignment on chip select is enabled
 *  @retval     false  Data alignment on chip select is disabled
 */
__STATIC_INLINE bool DL_QSPI_isPeripheralAlignDataOnChipSelectEnabled(
    QSPI_Regs *qspi)
{
    return ((qspi->CTL0 & QSPI_CTL0_CSCLR_MASK) == QSPI_CTL0_CSCLR_ENABLE);
}

/**
 *  @brief      Enables packing feature
 *
 *  When enabled, two entries of the RX FIFO are returned as a 32-bit value.
 *  When reading the TX FIFO, if the last write to that field was a 32-bit
 *  write, those 32-bits will be returned.
 *  When writing to the TX FIFO, a 32-bit write will be written as one FIFO
 *  entry.
 *
 *  @param[in]  qspi  pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_QSPI_enablePacking(QSPI_Regs *qspi)
{
    qspi->CTL0 |= QSPI_CTL0_PACKEN_ENABLED;
}

/**
 *  @brief      Disables packing feature
 *
 *  When disabled, 1 entry of the RX FIFO is returned as a 16-bit value.
 *  When reading the TX FIFO, if the last write to that field was a 16-bit
 *  write, those 16-bits wil be returned.
 *  When writing to the TX FIFO, a 32-bit write will be written as two FIFO
 *  entries.
 *
 *  @param[in]  qspi  pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_QSPI_disablePacking(QSPI_Regs *qspi)
{
    qspi->CTL0 &= ~(QSPI_CTL0_PACKEN_MASK);
}

/**
 *  @brief      Checks if packing feature is enabled
 *
 *  @param[in]  qspi  pointer to the register overlay for the peripheral
 *
 *  @return     If packing is enabled
 *
 *  @retval     true   Packing is enabled
 *  @retval     false  Packing is disabled
 */
__STATIC_INLINE bool DL_QSPI_isPackingEnabled(QSPI_Regs *qspi)
{
    return ((qspi->CTL0 & QSPI_CTL0_PACKEN_MASK) == QSPI_CTL0_PACKEN_ENABLED);
}

/**
 *  @brief      Set chip select used for controller or peripheral mode
 *
 *  Choose which chip select should be used for data transfer. User must ensure
 *  one of the 4-wire frame formats were selected using @ref DL_QSPI_init or
 *  @ref DL_QSPI_setFrameFormat.
 *
 * This API is for both controller and peripheral modes, and the chip select
 * can be changed in the application by calling this API.
 *
 *  @param[in]  qspi         pointer to the register overlay for the peripheral
 *  @param[in]  chipSelect  the chip select pin to use. One of @ref
 *                          DL_QSPI_CHIP_SELECT.
 */
__STATIC_INLINE void DL_QSPI_setChipSelect(
    QSPI_Regs *qspi, DL_QSPI_CHIP_SELECT chipSelect)
{
    DL_Common_updateReg(
        &qspi->CTL0, (uint32_t) chipSelect, QSPI_CTL0_CSSEL_MASK);
}

/**
 *  @brief      Get chip select used for controller or peripheral mode
 *
 *  This API is for both controller and peripheral modes.
 *
 *  @param[in]  qspi  pointer to the register overlay for the peripheral
 *
 *  @return     The current chip selected used for data transfer
 *
 *  @retval     One of @ref DL_QSPI_CHIP_SELECT.
 */
__STATIC_INLINE DL_QSPI_CHIP_SELECT DL_QSPI_getChipSelect(QSPI_Regs *qspi)
{
    uint32_t chipSelect = qspi->CTL0 & QSPI_CTL0_CSSEL_MASK;

    return (DL_QSPI_CHIP_SELECT)(chipSelect);
}

/**
 *  @brief      Set peripheral receive timeout
 *
 *  Sets the number of clock cycles before a receive timeout occurs.
 *
 *  This is only relevant when in peripheral mode.
 *
 *  @param[in]  qspi      pointer to the register overlay for the peripheral
 *  @param[in]  timeout  Number of clock cycles before a receive timeout
 *                       occurs. Must be between 0-63.
 *                       @arg 0 Disables receive timeout
 *                       @arg 1-63 Number of clock cycles before timeout
 */
__STATIC_INLINE void DL_QSPI_setPeripheralReceiveTimeout(
    QSPI_Regs *qspi, uint32_t timeout)
{
    DL_Common_updateReg(&qspi->CTL1, timeout << QSPI_CTL1_RXTIMEOUT_OFS,
        QSPI_CTL1_RXTIMEOUT_MASK);
}

/**
 *  @brief      Get peripheral receive timeout
 *
 *  This is only relevant when in peripheral mode.
 *
 *  @param[in]  qspi   pointer to the register overlay for the peripheral
 *
 *  @return     The current amount of cycles used for a peripheral timeout
 *
 *  @retval     0     indicating that receive timeout is disabled
 *  @retval     1-63  number of clock cycles before a receive timeout occurs
 */
__STATIC_INLINE uint32_t DL_QSPI_getPeripheralReceiveTimeout(QSPI_Regs *qspi)
{
    return ((qspi->CTL1 & QSPI_CTL1_RXTIMEOUT_MASK) >> QSPI_CTL1_RXTIMEOUT_OFS);
}

/**
 *  @brief      Configure the command/data mode
 *
 *  Command/data mode allows the hardware to control the C/D pin to indicate
 *  whether the data being transferred is a command or just data. The C/D pin
 *  is low for commands and high for data.
 *
 *  You can use this API to manually set the C/D pin by passing in @ref
 *  DL_QSPI_CD_MODE_DATA or @ref DL_QSPI_CD_MODE_COMMAND. You can also have the
 *  C/D pin switch automatically by passing in how many bytes are part of the
 *  command transfer. The C/D pin will stay low until that many bytes are sent
 *  out and then automatically switch to high.
 *
 *  This is only relevant when in controller mode.
 *
 *  @param[in]  qspi    pointer to the register overlay for the peripheral
 *  @param[in]  config configuration for command/data mode. One of:
 *                     @arg DL_QSPI_CD_MODE_DATA
 *                     @arg DL_QSPI_CD_MODE_COMMAND
 *                     @arg A value between 1-14 to indicate how many bytes
 *                          should be sent as command
 */
__STATIC_INLINE void DL_QSPI_setControllerCommandDataModeConfig(
    QSPI_Regs *qspi, uint32_t config)
{
    DL_Common_updateReg(
        &qspi->CTL1, config << QSPI_CTL1_CDMODE_OFS, QSPI_CTL1_CDMODE_MASK);
}

/**
 *  @brief      Get the command/data mode configuration
 *
 *  Returns the current configuration for command/data mode. When using the
 *  automatic C/D pin the value read back will be the number of command bytes
 *  remaining to be sent.
 *
 *  @param[in]  qspi    pointer to the register overlay for the peripheral
 *
 *  @return     The current configuration for command/data mode
 *
 *  @retval     DL_QSPI_CD_MODE_DATA    if in manual data mode
 *  @retval     DL_QSPI_CD_MODE_COMMAND if in manual command mode
 *  @retval     1-14 indicating how many command bytes still need to be sent
 */
__STATIC_INLINE uint32_t DL_QSPI_getControllerCommandDataModeConfig(
    QSPI_Regs *qspi)
{
    return ((qspi->CTL1 & QSPI_CTL1_CDMODE_MASK) >> QSPI_CTL1_CDMODE_OFS);
}

/**
 *  @brief      Enables command/data mode
 *
 *  When command/data mode is enabled, the C/D pin is used to differentiate
 *  between command and data during the transaction.
 *
 *  @param[in]  qspi  pointer to the register overlay for the peripheral
 *
 *  @sa         DL_QSPI_setControllerCommandDataModeConfig
 */
__STATIC_INLINE void DL_QSPI_enableControllerCommandDataMode(QSPI_Regs *qspi)
{
    qspi->CTL1 |= QSPI_CTL1_CDENABLE_ENABLE;
}

/**
 *  @brief      Disables command/data mode
 *
 *  @param[in]  qspi  pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_QSPI_disableControllerCommandDataMode(QSPI_Regs *qspi)
{
    qspi->CTL1 &= ~(QSPI_CTL1_CDENABLE_MASK);
}

/**
 *  @brief      Checks if command/data mode is enabled
 *
 *  @param[in]  qspi  pointer to the register overlay for the peripheral
 *
 *  @return     The status of command/data mode
 *
 *  @retval     true  Command/data mode is enabled
 *  @retval     false Command/data mode is disabled
 */
__STATIC_INLINE bool DL_QSPI_isControllerCommandDataModeEnabled(QSPI_Regs *qspi)
{
    return ((qspi->CTL1 & QSPI_CTL1_CDENABLE_MASK) == QSPI_CTL1_CDENABLE_ENABLE);
}

/**
 *  @brief      Enables peripheral data output
 *
 *  When peripheral data output is enabled, the peripheral can drive the POCI output pin.
 *  This will cause problems if all peripherals have their RXD lines tied together
 *  and the controller is trying to broadcast a message to all peripherals while
 *  ensuring only one peripheral drives data onto its serial output line.
 *
 *  @param[in]  qspi  pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_QSPI_enablePeripheralDataOutput(QSPI_Regs *qspi)
{
    qspi->CTL1 &= ~(QSPI_CTL1_POD_MASK);
}

/**
 *  @brief      Disables peripheral data output
 *
 *  When peripheral data output is disabled, the peripheral cannot drive the POCI output
 *  pin. This allows multiple peripherals that have their RXD lines tied together to
 *  receive a broadcasted message from a controller.
 *
 *  This is only relevant when in peripheral mode.
 *
 *  @param[in]  qspi  pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_QSPI_disablePeripheralDataOutput(QSPI_Regs *qspi)
{
    qspi->CTL1 |= QSPI_CTL1_POD_ENABLE;
}

/**
 *  @brief      Checks if peripheral data output is enabled
 *
 *  This is only relevant when in peripheral mode.
 *
 *  @param[in]  qspi  pointer to the register overlay for the peripheral
 *
 *  @return     If peripheral data output is enabled
 *
 *  @retval     true if peripheral data output is enabled
 *  @retval     false if peripheral data output is disabled
 */
__STATIC_INLINE bool DL_QSPI_isPeripheralDataOutputEnabled(QSPI_Regs *qspi)
{
    return ((qspi->CTL1 & QSPI_CTL1_POD_MASK) == QSPI_CTL1_POD_DISABLE);
}

/**
 *  @brief      Set the delay sampling
 *
 *  In controller mode only, the data on the input pin will be delayed sampled
 *  by the defined QSPI clock cycles. The delay can be adjusted in steps of QSPI
 *  input clock steps. The maximum allowed delay should not exceed the length
 *  of one data frame
 *
 *  @param[in]  qspi     Pointer to the register overlay for the peripheral
 *  @param[in]  delay   The number of QSPI clock cycles to delay sampling on
 *                      input pin. Value between 0-15.
 */
__STATIC_INLINE void DL_QSPI_setDelayedSampling(QSPI_Regs *qspi, uint32_t delay)
{
    DL_Common_updateReg(&qspi->CLKCTL, delay << QSPI_CLKCTL_DSAMPLE_OFS,
        QSPI_CLKCTL_DSAMPLE_MASK);
}

/**
 *  @brief      Get the delay sampling
 *
 *  In controller mode only, the data on the input pin will be delayed sampled
 *  by the defined QSPI clock cycles. The delay can be adjusted in steps of QSPI
 *  input clock steps. The maximum allowed delay should not exceed the length
 *  of one data frame
 *
 *  @param[in]  qspi  Pointer to the register overlay for the peripheral
 *
 *  @return     The amount of delay sampling on the input pin in QSPI
 *              clock cycles.
 *
 *  @retval     0 - 15. The amount of delay sampling in QSPI clock cycles.
 */
__STATIC_INLINE uint32_t DL_QSPI_getDelayedSampling(QSPI_Regs *qspi)
{
    return (qspi->CLKCTL & QSPI_CLKCTL_DSAMPLE_MASK >> QSPI_CLKCTL_DSAMPLE_OFS);
}

/**
 *  @brief      Set the RX and TX FIFO interrupt threshold level
 *
 *  Select the threshold for the receive and transmit FIFO interrupts. The
 *  interrupts are generated based on a transition through a level rather
 *  than being based on the level. That is, the interrupts are generated when
 *  the fill level progresses through the trigger level.
 *
 *  For example, if the trigger level is set to the half-way mark, the interrupt
 *  is triggered when the FIFO becomes half empty/full.
 *
 *  Out of reset, the FIFOs are triggered to interrupt at half-way mark.
 *
 *  @param[in]  qspi             Pointer to the register overlay for the peripheral
 *  @param[in]  rxThreshold     One of @ref DL_QSPI_RX_FIFO_LEVEL
 *  @param[in]  txThreshold     One of @ref DL_QSPI_TX_FIFO_LEVEL
 *
 */
__STATIC_INLINE void DL_QSPI_setFIFOThreshold(QSPI_Regs *qspi,
    DL_QSPI_RX_FIFO_LEVEL rxThreshold, DL_QSPI_TX_FIFO_LEVEL txThreshold)
{
    DL_Common_updateReg(&qspi->IFLS,
        (uint32_t) rxThreshold | (uint32_t) txThreshold,
        QSPI_IFLS_RXIFLSEL_MASK | QSPI_IFLS_TXIFLSEL_MASK);
}

/**
 *  @brief      Get the TX FIFO interrupt threshold level
 *
 *  @param[in]  qspi  Pointer to the register overlay for the peripheral
 *
 *  @return     The TX FIFO interrupt threshold level
 *
 *  @retval     One of @ref DL_QSPI_TX_FIFO_LEVEL
 */
__STATIC_INLINE DL_QSPI_TX_FIFO_LEVEL DL_QSPI_getTXFIFOThreshold(QSPI_Regs *qspi)
{
    uint32_t txThreshold = qspi->IFLS & QSPI_IFLS_TXIFLSEL_MASK;

    return (DL_QSPI_TX_FIFO_LEVEL)(txThreshold);
}

/**
 *  @brief      Get the RX FIFO interrupt threshold level
 *
 *  @param[in]  qspi  Pointer to the register overlay for the peripheral
 *
 *  @return     The RX FIFO interrupt threshold level
 *
 *  @retval     One of @ref DL_QSPI_RX_FIFO_LEVEL
 */
__STATIC_INLINE DL_QSPI_RX_FIFO_LEVEL DL_QSPI_getRXFIFOThreshold(QSPI_Regs *qspi)
{
    uint32_t rxThreshold = qspi->IFLS & QSPI_IFLS_RXIFLSEL_MASK;

