TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_qspi.h
    return (DL_QSPI_RX_FIFO_LEVEL)(rxThreshold);
}

/**
 *  @brief      Set the QSPI bit rate serial clock divider (SCR)
 *
 * The QSPI includes a programmable bit rate clock divider and prescaler to
 * generate the serial output clock. The bit rates are supported up to
 * FUNCCLK/2. The functional clock selection depends on the specific device,
 * please refer to the device datasheet and PMU/Clock section.
 *
 * The QSPI output bit rate is calculated with the following formula:
 * QSPI bit rate = (QSPI functional clock) / ((1 + SCR)*2)
 * Given this formula, the SCR can be calculated:
 * SCR = (QSPI functional clock) / ((2 * QSPI bit rate) - 1)
 *
 *  @param[in]  qspi  Pointer to the register overlay for the peripheral
 *  @param[in]  SCR  The QSPI serial clock divider. Value between 0-1023.
 */
__STATIC_INLINE void DL_QSPI_setBitRateSerialClockDivider(
    QSPI_Regs *qspi, uint32_t SCR)
{
    DL_Common_updateReg(&qspi->CLKCTL, SCR, QSPI_CLKCTL_SCR_MASK);
}

/**
 *  @brief      Get the QSPI bit rate serial clock divider (SCR)
 *
 *  @param[in]  qspi  Pointer to the register overlay for the peripheral
 *
 *  @return     The current bit rate serial clock divider
 *
 *  @retval     The QSPI SCR. Value from 0-1023
 */
__STATIC_INLINE uint32_t DL_QSPI_getBitRateSerialClockDivider(QSPI_Regs *qspi)
{
    return (qspi->CLKCTL & QSPI_CLKCTL_SCR_MASK);
}

/**
 *  @brief      Writes 8-bit data into the TX FIFO for transmit
 *
 *  Puts the data into the TX FIFO without checking its status. Use if already
 *  sure the TX FIFO has space for the write. See related APIs for additional
 *  transmit options.
 *
 *  Can be used for any data transfers that are less than or equal to 8 bits.
 *
 *  @param[in]  qspi   pointer to the register overlay for the peripheral
 *  @param[in]  data  data to send
 *
 *  @sa         DL_QSPI_transmitDataBlocking8
 *  @sa         DL_QSPI_transmitDataCheck8
 */
__STATIC_INLINE void DL_QSPI_transmitData8(QSPI_Regs *qspi, uint8_t data)
{
    qspi->TXDATA = data;
}

/**
 *  @brief      Writes 16-bit data into the TX FIFO for transmit
 *
 *  Puts the data into the TX FIFO without checking its status. Use if already
 *  sure the TX FIFO has space for the write. See related APIs for additional
 *  transmit options.
 *
 *  Can be used for any data transfers that are less than or equal to 16 bits.
 *
 *  @param[in]  qspi   pointer to the register overlay for the peripheral
 *  @param[in]  data  data to send
 *
 *  @sa         DL_QSPI_transmitDataBlocking16
 *  @sa         DL_QSPI_transmitDataCheck16
 */
__STATIC_INLINE void DL_QSPI_transmitData16(QSPI_Regs *qspi, uint16_t data)
{
    qspi->TXDATA = data;
}

/**
 *  @brief      Writes 32-bit data into the TX FIFO for transmit
 *
 *  Puts the data into the TX FIFO without checking its status. Use if already
 *  sure the TX FIFO has space for the write. See related APIs for additional
 *  transmit options.
 *
 *  Can be used for any data transfers that are less than or equal to 32 bits.
 *
 *  NOTE: If packing is enabled by calling @ref DL_QSPI_enablePacking prior to
 *  calling this API, then a 32-bit write will be written as one FIFO entry. If
 *  packing is disabled, then a 32-bit write will be written as two FIFO
 *  entries.
 *
 *  @param[in]  qspi   pointer to the register overlay for the peripheral
 *  @param[in]  data  data to send
 *
 *  @sa         DL_QSPI_enablePacking
 *  @sa         DL_QSPI_transmitDataBlocking32
 *  @sa         DL_QSPI_transmitDataCheck32
 */
__STATIC_INLINE void DL_QSPI_transmitData32(QSPI_Regs *qspi, uint32_t data)
{
    qspi->TXDATA = data;
}

/**
 *  @brief      Reads 8-bit data from the RX FIFO
 *
 *  Reads the data from the RX FIFO without checking its status. Use if
 *  already sure the RX FIFO has data available. See related APIs for
 *  additional receive options.
 *
 *  Can be used for any data transfers that are less than or equal to 8 bits.
 *
 *  @param[in]  qspi   pointer to the register overlay for the peripheral
 *
 *  @return     The data in the RX FIFO
 *
 *  @sa         DL_QSPI_receiveDataBlocking8
 *  @sa         DL_QSPI_receiveDataCheck8
 */
__STATIC_INLINE uint8_t DL_QSPI_receiveData8(QSPI_Regs *qspi)
{
    return ((uint8_t)(qspi->RXDATA));
}

/**
 *  @brief      Reads 16-bit data from the RX FIFO
 *
 *  Reads the data from the RX FIFO without checking its status. Use if
 *  already sure the RX FIFO has data available. See related APIs for
 *  additional receive options.
 *
 *  Can be used for any data transfers that are less than or equal to 16 bits.
 *
 *  @param[in]  qspi   pointer to the register overlay for the peripheral
 *
 *  @return     The data in the RX FIFO
 *
 *  @sa         DL_QSPI_receiveDataBlocking16
 *  @sa         DL_QSPI_receiveDataCheck16
 */
__STATIC_INLINE uint16_t DL_QSPI_receiveData16(QSPI_Regs *qspi)
{
    return ((uint16_t)(qspi->RXDATA));
}

/**
 *  @brief      Reads 32-bit data from the RX FIFO
 *
 *  Reads the data from the RX FIFO without checking its status. Use if
 *  already sure the RX FIFO has data available. See related APIs for
 *  additional receive options.
 *
 *  Can be used for any data transfers that are less than or equal to 32 bits.
 *
 *  NOTE: Requires that packing has been enabled by calling
 *  @ref DL_QSPI_enablePacking prior to calling this API. When packing is
 *  enabled, two entries of the RX FIFO are returned as a 32-bit value.
 *
 *  @param[in]  qspi   pointer to the register overlay for the peripheral
 *
 *  @return     The data in the RX FIFO
 *
 *  @pre         DL_QSPI_enablePacking
 *
 *  @sa         DL_QSPI_receiveDataBlocking32
 *  @sa         DL_QSPI_receiveDataCheck32
 */
__STATIC_INLINE uint32_t DL_QSPI_receiveData32(QSPI_Regs *qspi)
{
    return qspi->RXDATA;
}

/**
 *  @brief      Enable QSPI interrupts
 *
 *  @param[in]  qspi            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to enable. Bitwise OR of
 *                             @ref DL_QSPI_INTERRUPT.
 */
__STATIC_INLINE void DL_QSPI_enableInterrupt(
    QSPI_Regs *qspi, uint32_t interruptMask)
{
    qspi->CPU_INT.IMASK |= interruptMask;
}

/**
 *  @brief      Disable QSPI interrupts
 *
 *  @param[in]  qspi            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to disable. Bitwise OR of
 *                             @ref DL_QSPI_INTERRUPT.
 */
__STATIC_INLINE void DL_QSPI_disableInterrupt(
    QSPI_Regs *qspi, uint32_t interruptMask)
{
    qspi->CPU_INT.IMASK &= ~(interruptMask);
}

/**
 *  @brief      Check which QSPI interrupts are enabled
 *
 *  @param[in]  qspi            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_QSPI_INTERRUPT.
 *
 *  @return     Which of the requested QSPI interrupts are enabled
 *
 *  @retval     Bitwise OR of @ref DL_QSPI_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_QSPI_getEnabledInterrupts(
    QSPI_Regs *qspi, uint32_t interruptMask)
{
    return (qspi->CPU_INT.IMASK & interruptMask);
}

/**
 *  @brief      Check interrupt flag of enabled QSPI interrupts
 *
 *  Checks if any of the QSPI interrupts that were previously enabled are
 *  pending.
 *
 *  @param[in]  qspi            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_QSPI_INTERRUPT.
 *
 *  @return     Which of the requested QSPI interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_QSPI_INTERRUPT values
 *
 *  @sa         DL_QSPI_enableInterrupt
 */
__STATIC_INLINE uint32_t DL_QSPI_getEnabledInterruptStatus(
    QSPI_Regs *qspi, uint32_t interruptMask)
{
    return (qspi->CPU_INT.MIS & interruptMask);
}

/**
 *  @brief      Check interrupt flag of any QSPI interrupt
 *
 *  Checks if any of the QSPI interrupts are pending. Interrupts do not have to
 *  be previously enabled.
 *
 *  @param[in]  qspi            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_QSPI_INTERRUPT.
 *
 *  @return     Which of the requested QSPI interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_QSPI_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_QSPI_getRawInterruptStatus(
    QSPI_Regs *qspi, uint32_t interruptMask)
{
    return (qspi->CPU_INT.RIS & interruptMask);
}

/**
 *  @brief      Get highest priority pending QSPI interrupt
 *
 *  Checks if any of the QSPI interrupts are pending. Interrupts do not have to
 *  be previously enabled.
 *
 *  @param[in]  qspi            Pointer to the register overlay for the
 *                             peripheral
 *
 *  @return     The highest priority pending QSPI interrupt. One of @ref
 *               DL_QSPI_IIDX
 */
__STATIC_INLINE DL_QSPI_IIDX DL_QSPI_getPendingInterrupt(QSPI_Regs *qspi)
{
    return ((DL_QSPI_IIDX) qspi->CPU_INT.IIDX);
}

/**
 *  @brief      Clear pending QSPI interrupts
 *
 *  @param[in]  qspi            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to clear. Bitwise OR of
 *                             @ref DL_QSPI_INTERRUPT.
 */
__STATIC_INLINE void DL_QSPI_clearInterruptStatus(
    QSPI_Regs *qspi, uint32_t interruptMask)
{
    qspi->CPU_INT.ICLR = interruptMask;
}

/**
 *  @brief      Blocks to ensure transmit is ready before sending data
 *
 *  Puts the data into the TX FIFO after blocking to ensure the TX FIFO is not
 *  full. Will wait indefinitely until there is space in the TX FIFO. See
 *  related APIs for additional transmit options.
 *
 *  Can be used for any data transfers that are less than or equal to 8 bits.
 *
 *  @param[in]  qspi   pointer to the register overlay for the peripheral
 *  @param[in]  data  data to send
 *
 *  @sa         DL_QSPI_transmitData8
 *  @sa         DL_QSPI_transmitDataCheck8
 */
void DL_QSPI_transmitDataBlocking8(QSPI_Regs *qspi, uint8_t data);

/**
 *  @brief      Blocks to ensure transmit is ready before sending data
 *
 *  Puts the data into the TX FIFO after blocking to ensure the TX FIFO is not
 *  full. Will wait indefinitely until there is space in the TX FIFO. See related
 *  APIs for additional transmit options.
 *
 *  Can be used for any data transfers that are less than or equal to 16 bits.
 *
 *  @param[in]  qspi   pointer to the register overlay for the peripheral
 *  @param[in]  data  data to send
 *
 *  @sa         DL_QSPI_transmitData16
 *  @sa         DL_QSPI_transmitDataCheck16
 */
void DL_QSPI_transmitDataBlocking16(QSPI_Regs *qspi, uint16_t data);

/**
 *  @brief      Blocks to ensure transmit is ready before sending data
 *
 *  Puts the data into the TX FIFO after blocking to ensure the TX FIFO is not
 *  full. Will wait indefinitely until there is space in the TX FIFO. See related
 *  APIs for additional transmit options.
 *
 *  Can be used for any data transfers that are less than or equal to 32 bits.
 *
 *  NOTE: If packing is enabled by calling @ref DL_QSPI_enablePacking prior to
 *  calling this API, then a 32-bit write will be written as one FIFO entry. If
 *  packing is disabled, then a 32-bit write will be written as two FIFO
 *  entries.
 *
 *  @param[in]  qspi   pointer to the register overlay for the peripheral
 *  @param[in]  data  data to send
 *
 *  @sa         DL_QSPI_enablePacking
 *  @sa         DL_QSPI_transmitData32
 *  @sa         DL_QSPI_transmitDataCheck32
 */
void DL_QSPI_transmitDataBlocking32(QSPI_Regs *qspi, uint32_t data);

/**
 *  @brief      Blocks to ensure receive is ready before reading data
 *
 *  Reads the data from the RX FIFO after blocking to ensure the RX FIFO is not
 *  empty. Will wait indefinitely until there is data in the RX FIFO. See
 *  related APIs for additional receive options.
 *
 *  Can be used for any data transfers that are less than or equal to 8 bits.
 *
 *  @param[in]  qspi   pointer to the register overlay for the peripheral
 *
 *  @return     The data in the RX FIFO
 *
 *  @sa         DL_QSPI_transmitData8
 *  @sa         DL_QSPI_transmitDataCheck8
 */
uint8_t DL_QSPI_receiveDataBlocking8(QSPI_Regs *qspi);

/**
 *  @brief      Blocks to ensure receive is ready before reading data
 *
 *  Reads the data from the RX FIFO after blocking to ensure the RX FIFO is not
 *  empty. Will wait indefinitely until there is data in the RX FIFO. See
 *  related APIs for additional receive options.
 *
 *  Can be used for any data transfers that are less than or equal to 16 bits.
 *
 *  @param[in]  qspi   pointer to the register overlay for the peripheral
 *
 *  @return     The data in the RX FIFO
 *
 *  @sa         DL_QSPI_transmitData16
 *  @sa         DL_QSPI_transmitDataCheck16
 */
uint16_t DL_QSPI_receiveDataBlocking16(QSPI_Regs *qspi);

/**
 *  @brief      Blocks to ensure receive is ready before reading data
 *
 *  Reads the data from the RX FIFO after blocking to ensure the RX FIFO is not
 *  empty. Will wait indefinitely until there is data in the RX FIFO. See
 *  related APIs for additional receive options.
 *
 *  Can be used for any data transfers that are less than or equal to 32 bits.
 *
 *  NOTE: Requires that packing has been enabled by calling
 *  @ref DL_QSPI_enablePacking prior to calling this API. When packing is
 *  enabled, two entries of the RX FIFO are returned as a 32-bit value.
 *
 *  @param[in]  qspi   pointer to the register overlay for the peripheral
 *
 *  @return     The data in the RX FIFO
 *
 *  @pre         DL_QSPI_enablePacking
 *
 *  @sa         DL_QSPI_transmitData32
 *  @sa         DL_QSPI_transmitDataCheck32
 */
uint32_t DL_QSPI_receiveDataBlocking32(QSPI_Regs *qspi);

/**
 *  @brief      Checks the TX FIFO before trying to transmit data
 *
 *  Checks if the TX FIFO is already full before trying to add new data to the
 *  FIFO. Exits immediately if full rather than trying to block. See related
 *  APIs for additional transmit options.
 *
 *  Can be used for any data transfers that are less than or equal to 8 bits.
 *
 *  @param[in]  qspi   pointer to the register overlay for the peripheral
 *  @param[in]  data  data to send
 *
 *  @return     If the transmit occurred
 *
 *  @retval     true  if data was added to the TX FIFO
 *  @retval     false if the TX FIFO was full and data was not added
 *
 *  @sa         DL_QSPI_transmitData8
 *  @sa         DL_QSPI_transmitDataBlocking8
 */
bool DL_QSPI_transmitDataCheck8(QSPI_Regs *qspi, uint8_t data);

/**
 *  @brief      Checks the TX FIFO before trying to transmit data
 *
 *  Checks if the TX FIFO is already full before trying to add new data to the
 *  FIFO. Exits immediately if full rather than trying to block. See related
 *  APIs for additional transmit options.
 *
 *  Can be used for any data transfers that are less than or equal to 16 bits.
 *
 *  @param[in]  qspi   pointer to the register overlay for the peripheral
 *  @param[in]  data  data to send
 *
 *  @return     If the transmit occurred
 *
 *  @retval     true  if data was added to the TX FIFO
 *  @retval     false if the TX FIFO was full and data was not added
 *
 *  @sa         DL_QSPI_transmitData16
 *  @sa         DL_QSPI_transmitDataBlocking16
 */
bool DL_QSPI_transmitDataCheck16(QSPI_Regs *qspi, uint16_t data);

/**
 *  @brief      Checks the TX FIFO before trying to transmit data
 *
 *  Checks if the TX FIFO is already full before trying to add new data to the
 *  FIFO. Exits immediately if full rather than trying to block. See related
 *  APIs for additional transmit options.
 *
 *  Can be used for any data transfers that are less than or equal to 32 bits.
 *
 *  NOTE: If packing is enabled by calling @ref DL_QSPI_enablePacking prior to
 *  calling this API, then a 32-bit write will be written as one FIFO entry. If
 *  packing is disabled, then a 32-bit write will be written as two FIFO
 *  entries.
 *
 *  @param[in]  qspi   pointer to the register overlay for the peripheral
 *  @param[in]  data  data to send
 *
 *  @return     If the transmit occurred
 *
 *  @retval     true  if data was added to the TX FIFO
 *  @retval     false if the TX FIFO was full and data was not added
 *
 *  @sa         DL_QSPI_enablePacking
 *  @sa         DL_QSPI_transmitData32
 *  @sa         DL_QSPI_transmitDataBlocking32
 */
bool DL_QSPI_transmitDataCheck32(QSPI_Regs *qspi, uint32_t data);

/**
 *  @brief      Checks the RX FIFO before trying to transmit data
 *
 *  Checks if the RX FIFO is already empty before trying to read new data from
 *  the FIFO. Exits immediately if empty rather than trying to block. See
 *  related APIs for additional receive options.
 *
 *  Can be used for any data transfers that are less than or equal to 8 bits.
 *
 *  @param[in]  qspi    pointer to the register overlay for the peripheral
 *  @param[in]  buffer a buffer to write the received data into
 *
 *  @return     If the receive occurred
 *
 *  @retval     true  if data was read from the RX FIFO
 *  @retval     false if the RX FIFO was empty and data was not read
 *
 *  @sa         DL_QSPI_receiveData8
 *  @sa         DL_QSPI_receiveDataBlocking8
 */
bool DL_QSPI_receiveDataCheck8(QSPI_Regs *qspi, uint8_t *buffer);

/**
 *  @brief      Checks the RX FIFO before trying to transmit data
 *
 *  Checks if the RX FIFO is already empty before trying to read new data from
 *  the FIFO. Exits immediately if empty rather than trying to block. See
 *  related APIs for additional receive options.
 *
 *  Can be used for any data transfers that are less than or equal to 16 bits.
 *
 *  @param[in]  qspi    pointer to the register overlay for the peripheral
 *  @param[in]  buffer a buffer to write the received data into
 *
 *  @return     If the receive occurred
 *
 *  @retval     true  if data was read from the RX FIFO
 *  @retval     false if the RX FIFO was empty and data was not read
 *
 *  @sa         DL_QSPI_receiveData16
 *  @sa         DL_QSPI_receiveDataBlocking16
 */
bool DL_QSPI_receiveDataCheck16(QSPI_Regs *qspi, uint16_t *buffer);

/**
 *  @brief      Checks the RX FIFO before trying to transmit data
 *
 *  Checks if the RX FIFO is already empty before trying to read new data from
 *  the FIFO. Exits immediately if empty rather than trying to block. See
 *  related APIs for additional receive options.
 *
 *  Can be used for any data transfers that are less than or equal to 32 bits.
 *
 *  NOTE: Requires that packing has been enabled by calling
 *  @ref DL_QSPI_enablePacking prior to calling this API. When packing is
 *  enabled, two entries of the RX FIFO are returned as a 32-bit value.
 *
 *  @param[in]  qspi    pointer to the register overlay for the peripheral
 *  @param[in]  buffer a buffer to write the received data into
 *
 *  @return     If the receive occurred
 *
 *  @retval     true  if data was read from the RX FIFO
 *  @retval     false if the RX FIFO was empty and data was not read
 *
 *  @pre         DL_QSPI_enablePacking
 *
 *  @sa         DL_QSPI_receiveData32
 *  @sa         DL_QSPI_receiveDataBlocking32
 */
bool DL_QSPI_receiveDataCheck32(QSPI_Regs *qspi, uint32_t *buffer);

/**
 *  @brief       Read all available data out of the RX FIFO using 8 bit access
 *
 *  @param[in]   qspi       Pointer to the register overlay for the peripheral
 *  @param[out]  buffer    Buffer to write received data into
 *  @param[in]   maxCount  Max number of bytes to read from the RX FIFO
 *
 *  @return      Number of bytes read from the RX FIFO
 */
uint32_t DL_QSPI_drainRXFIFO8(
    QSPI_Regs *qspi, uint8_t *buffer, uint32_t maxCount);

/**
 *  @brief       Read all available data out of the RX FIFO using 16 bit access
 *
 *  @param[in]   qspi       Pointer to the register overlay for the peripheral
 *  @param[out]  buffer    Buffer to write received data into
 *  @param[in]   maxCount  Max number of halfwords to read from the RX FIFO
 *
 *  @return      Number of halfwords read from the RX FIFO
 */
uint32_t DL_QSPI_drainRXFIFO16(
    QSPI_Regs *qspi, uint16_t *buffer, uint32_t maxCount);

/**
 *  @brief       Read all available data out of the RX FIFO using 32 bit access
 *
 *  NOTE: Requires that packing has been enabled by calling
 *  @ref DL_QSPI_enablePacking prior to calling this API. When packing is
 *  enabled, two entries of the RX FIFO are returned as a 32-bit value.
 *
 *  @param[in]   qspi       Pointer to the register overlay for the peripheral
 *  @param[out]  buffer    Buffer to write received data into
 *  @param[in]   maxCount  Max number of words to read from the RX FIFO
 *
 *  @return      Number of words read from the RX FIFO
 *
 *  @pre         DL_QSPI_enablePacking
 *
 */
uint32_t DL_QSPI_drainRXFIFO32(
    QSPI_Regs *qspi, uint32_t *buffer, uint32_t maxCount);

/**
 *  @brief      Fill the TX FIFO using 8 bit access
 *
 *  Continuously write data into the TX FIFO until it is filled up or count has
 *  been reached.
 *
 *  @param[in]  qspi     Pointer to the register overlay for the peripheral
 *  @param[in]  buffer  Buffer of data to write to the TX FIFO
 *  @param[in]  count   Max number of bytes to write to the TX FIFO
 *
 *  @return     Number of bytes written to the TX FIFO
 */
uint32_t DL_QSPI_fillTXFIFO8(QSPI_Regs *qspi, uint8_t *buffer, uint32_t count);

/**
 *  @brief      Fill the TX FIFO using 16 bit access
 *
 *  Continuously write data into the TX FIFO until it is filled up or count has
 *  been reached.
 *
 *  @param[in]  qspi     Pointer to the register overlay for the peripheral
 *  @param[in]  buffer  Buffer of data to write to the TX FIFO
 *  @param[in]  count   Max number of halfwords to write to the TX FIFO
 *
 *  @return     Number of halfwords written to the TX FIFO
 */
uint32_t DL_QSPI_fillTXFIFO16(QSPI_Regs *qspi, uint16_t *buffer, uint32_t count);

/**
 *  @brief      Fill the TX FIFO using 32 bit access
 *
 *  Continuously write data into the TX FIFO until it is filled up or count has
 *  been reached.
 *
 *  NOTE: If packing is enabled by calling @ref DL_QSPI_enablePacking prior to
 *  calling this API, then a 32-bit write will be written as one FIFO entry. If
 *  packing is disabled, then a 32-bit write will be written as two FIFO
 *  entries.
 *
 *  @param[in]  qspi     Pointer to the register overlay for the peripheral
 *  @param[in]  buffer  Buffer of data to write to the TX FIFO
 *  @param[in]  count   Max number of words to write to the TX FIFO
 *
 *  @return     Number of words written to the TX FIFO
 *
 *  @sa         DL_QSPI_enablePacking
 */
uint32_t DL_QSPI_fillTXFIFO32(QSPI_Regs *qspi, uint32_t *buffer, uint32_t count);

/**
 *  @brief      Enable QSPI interrupt for triggering the DMA receive event
 *
 * Enables the QSPI interrupt to be used as the condition to generate an
 * event to directly trigger the DMA. This API configures the DMA_TRIG_RX
 * register, which is the event publisher used for triggering the DMA to do
 * a receive data transfer.
 *
 * @note Only one interrupt source should be enabled at a time.
 *
 *  @param[in]  qspi       Pointer to the register overlay for the
 *                         peripheral
 *  @param[in]  interrupt  Interrupt to enable as the trigger condition for
 *                         the DMA. One of @ref DL_QSPI_DMA_INTERRUPT_RX.
 */
__STATIC_INLINE void DL_QSPI_enableDMAReceiveEvent(
    QSPI_Regs *qspi, uint32_t interrupt)
{
    qspi->DMA_TRIG_RX.IMASK = interrupt;
}

