TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_qspi.h
/**
 *  @brief      Enable QSPI interrupt for triggering the DMA transmit event
 *
 * Enables the QSPI interrupt to be used as the condition to generate an
 * event to directly trigger the DMA. This API configures the DMA_TRIG_TX
 * register, which is the event publisher used for triggering the DMA to do
 * a transmit data transfer.
 *
 * @note DMA_TRIG_TX only has one transmit interrupt source
 *
 *  @param[in]  qspi       Pointer to the register overlay for the
 *                         peripheral
 */
__STATIC_INLINE void DL_QSPI_enableDMATransmitEvent(QSPI_Regs *qspi)
{
    qspi->DMA_TRIG_TX.IMASK = QSPI_DMA_TRIG_TX_IMASK_TX_SET;
}

/**
 *  @brief      Disables QSPI interrupt from triggering the DMA receive event
 *
 * Disables the QSPI interrupt as the condition to generate an event to
 * directly trigger the DMA. This API configures the DMA_TRIG_RX
 * register, which is the event publisher used for triggering the DMA to do
 * a receive data transfer.
 *
 *  @param[in]  qspi       Pointer to the register overlay for the
 *                         peripheral
 *  @param[in]  interrupt  Interrupt to disable as the trigger condition for
 *                         the DMA. One of @ref DL_QSPI_DMA_INTERRUPT_RX.
 */
__STATIC_INLINE void DL_QSPI_disableDMAReceiveEvent(
    QSPI_Regs *qspi, uint32_t interrupt)
{
    qspi->DMA_TRIG_RX.IMASK &= ~(interrupt);
}

/**
 *  @brief      Disables QSPI interrupt from triggering the DMA transmit event
 *
 * Disables the QSPI interrupt as the condition to generate an event to
 * directly trigger the DMA. This API configures the DMA_TRIG_TX
 * register, which is the event publisher used for triggering the DMA to do
 * a transmit data transfer.
 *
 * @note DMA_TRIG_TX only has one transmit interrupt source
 *
 * @param[in]  qspi       Pointer to the register overlay for the
 *                       peripheral
 */
__STATIC_INLINE void DL_QSPI_disableDMATransmitEvent(QSPI_Regs *qspi)
{
    qspi->DMA_TRIG_TX.IMASK = QSPI_DMA_TRIG_TX_IMASK_TX_CLR;
}

/**
 *  @brief      Check which QSPI interrupt for DMA receive events is enabled
 *
 *  This API checks the DMA_TRIG_RX register, which is the event publisher used
 *  for triggering the DMA to do a receive data transfer.
 *
 *  @param[in]  qspi            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_QSPI_DMA_INTERRUPT_RX.
 *
 *  @note Only one interrupt source should be enabled at a time.
 *
 *  @return     Which of the requested QSPI interrupts is enabled
 *
 *  @retval     One of @ref DL_QSPI_DMA_INTERRUPT_RX
 */
__STATIC_INLINE uint32_t DL_QSPI_getEnabledDMAReceiveEvent(
    QSPI_Regs *qspi, uint32_t interruptMask)
{
    return (qspi->DMA_TRIG_RX.IMASK & interruptMask);
}

/**
 *  @brief      Check if QSPI interrupt for DMA transmit event is enabled
 *
 *  This API checks the DMA_TRIG_TX register, which is the event publisher used
 *  for triggering the DMA to do a transmit data transfer.
 *
 *  @param[in]  qspi           Pointer to the register overlay for the
 *                            peripheral
 *
 *  @return     The requested QSPI interrupt status
 *
 *  @retval     DL_QSPI_DMA_INTERRUPT_TX if enabled, 0 if not enabled
 */
__STATIC_INLINE uint32_t DL_QSPI_getEnabledDMATransmitEvent(QSPI_Regs *qspi)
{
    return (qspi->DMA_TRIG_TX.IMASK & QSPI_DMA_TRIG_TX_IMASK_TX_MASK);
}

/**
 *  @brief      Check interrupt flag of enabled QSPI interrupt for DMA receive event
 *
 * Checks if any of the QSPI interrupts for the DMA receive event that were
 * previously enabled are pending.
 * This API checks the DMA_TRIG_RX register, which is the event publisher used
 * for triggering the DMA to do a receive data transfer.
 *
 *  @param[in]  qspi            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_QSPI_DMA_INTERRUPT_RX.
 *
 *  @note Only one interrupt source should be enabled at a time.
 *
 *  @return     The requested QSPI interrupt status
 *
 *  @retval     One of @ref DL_QSPI_DMA_INTERRUPT_RX
 *
 *  @sa         DL_QSPI_enableDMAReceiveEvent
 */
__STATIC_INLINE uint32_t DL_QSPI_getEnabledDMAReceiveEventStatus(
    QSPI_Regs *qspi, uint32_t interruptMask)
{
    return (qspi->DMA_TRIG_RX.MIS & interruptMask);
}

/**
 *  @brief      Check interrupt flag of enabled QSPI interrupt for DMA transmit event
 *
 * Checks if the QSPI interrupt for the DMA transmit event that was
 * previously enabled is pending.
 * This API checks the DMA_TRIG_TX register, which is the event publisher used
 * for triggering the DMA to do a transmit data transfer.
 *
 *  @param[in]  qspi           Pointer to the register overlay for the
 *                            peripheral
 *
 *  @return     The requested QSPI interrupt status
 *
 *  @retval     DL_QSPI_DMA_INTERRUPT_TX if enabled, 0 if not enabled
 *
 *  @sa         DL_QSPI_enableDMATransmitEvent
 */
__STATIC_INLINE uint32_t DL_QSPI_getEnabledDMATransmitEventStatus(QSPI_Regs *qspi)
{
    return (qspi->DMA_TRIG_TX.MIS & QSPI_DMA_TRIG_TX_MIS_TX_MASK);
}

/**
 *  @brief      Check interrupt flag of any QSPI interrupt for DMA receive event
 *
 *  Checks if any of the QSPI interrupts for DMA receive event are pending.
 *  Interrupts do not have to be previously enabled.
 *  This API checks the DMA_TRIG_RX register, which is the event publisher used
 *  for triggering the DMA to do a receive data transfer.
 *
 *  @param[in]  qspi            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_QSPI_DMA_INTERRUPT_RX.
 *
 *  @return     Which of the requested QSPI interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_QSPI_DMA_INTERRUPT_RX values
 */
__STATIC_INLINE uint32_t DL_QSPI_getRawDMAReceiveEventStatus(
    QSPI_Regs *qspi, uint32_t interruptMask)
{
    return (qspi->DMA_TRIG_RX.RIS & interruptMask);
}

/**
 *  @brief      Check interrupt flag of any QSPI interrupt for DMA transmit event
 *
 *  Checks if any of the QSPI interrupts for DMA transmit event are pending.
 *  Interrupts do not have to be previously enabled.
 *  This API checks the DMA_TRIG_TX register, which is the event publisher used
 *  for triggering the DMA to do a transmit data transfer.
 *
 *  @param[in]  qspi           Pointer to the register overlay for the
 *                            peripheral
 *
 *  @return     The requested QSPI interrupt status
 *
 *  @retval     DL_QSPI_DMA_INTERRUPT_TX if enabled, 0 if not enabled
 */
__STATIC_INLINE uint32_t DL_QSPI_getRawDMATransmitEventStatus(QSPI_Regs *qspi)
{
    return (qspi->DMA_TRIG_TX.RIS & QSPI_DMA_TRIG_TX_RIS_TX_MASK);
}

/**
 *  @brief      Get highest priority pending QSPI interrupt for DMA receive event
 *
 *  Checks if any of the QSPI interrupts for DMA receive event are pending.
 *  Interrupts do not have to be previously enabled.
 *  This API checks the DMA_TRIG_RX register, which is the event publisher used
 *  for triggering the DMA to do a receive data transfer.
 *
 *
 *  @param[in]  qspi           Pointer to the register overlay for the
 *                            peripheral
 *
 *  @return     The highest priority pending QSPI interrupt
 *
 *  @retval     One of @ref DL_QSPI_DMA_IIDX_RX
 */
__STATIC_INLINE DL_QSPI_DMA_IIDX_RX DL_QSPI_getPendingDMAReceiveEvent(
    QSPI_Regs *qspi)
{
    return (DL_QSPI_DMA_IIDX_RX)(qspi->DMA_TRIG_RX.IIDX);
}

/**
 *  @brief      Get highest priority pending QSPI interrupt for DMA transmit event
 *
 *  Checks if the QSPI interrupt for DMA transmit event is pending.
 *  Interrupts do not have to be previously enabled.
 *  This API checks the DMA_TRIG_TX register, which is the event publisher used
 *  for triggering the DMA to do a transmit data transfer.
 *
 *
 *  @param[in]  qspi           Pointer to the register overlay for the
 *                            peripheral
 *
 *  @return     The highest priority pending QSPI interrupt
 *
 *  @retval     DL_QSPI_DMA_IIDX_TX if pending, 0 if not pending
 */
__STATIC_INLINE DL_QSPI_DMA_IIDX_TX DL_QSPI_getPendingDMATransmitEvent(
    QSPI_Regs *qspi)
{
    return (DL_QSPI_DMA_IIDX_TX)(qspi->DMA_TRIG_TX.IIDX);
}

/**
 *  @brief      Clear pending QSPI interrupts for DMA receive event
 *
 *  This API checks the DMA_TRIG_RX register, which is the event publisher used
 *  for triggering the DMA to do a receive data transfer.
 *
 *  @param[in]  qspi            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to clear. Bitwise OR of
 *                             @ref DL_QSPI_DMA_INTERRUPT_RX.
 */
__STATIC_INLINE void DL_QSPI_clearDMAReceiveEventStatus(
    QSPI_Regs *qspi, uint32_t interruptMask)
{
    qspi->DMA_TRIG_RX.ICLR = interruptMask;
}

/**
 *  @brief      Clear pending QSPI interrupt for DMA transmit event
 *
 *  This API checks the DMA_TRIG_TX register, which is the event publisher used
 *  for triggering the DMA to do a transmit data transfer.
 *
 *  @param[in]  qspi           Pointer to the register overlay for the
 *                            peripheral
 * @note DMA_TRIG_TX only has one transmit interrupt source
 */
__STATIC_INLINE void DL_QSPI_clearDMATransmitEventStatus(QSPI_Regs *qspi)
{
    qspi->DMA_TRIG_TX.ICLR = QSPI_DMA_TRIG_TX_ICLR_TX_CLR;
}

/**
 *  @brief      Save QSPI configuration before entering a power loss state.
 *
 *  Some MSPM33 peripherals residing in PD1 domain do not retain register
 *  contents when entering STOP or STANDBY modes. Please refer to the datasheet
 *  for the full list of peripheral instances that exhibit this behavior.
 *
 *  @param[in]  qspi  Pointer to the register overlay for the peripheral
 *
 *  @param[in]  ptr  Configuration backup setup structure. See
 *                  @ref DL_QSPI_backupConfig.
 *
 *  @retval     FALSE if a configuration already exists in ptr (will not be
 *              overwritten). TRUE if a configuration was successfully saved
 *
 *  @sa         DL_QSPI_restoreConfiguration
 */
bool DL_QSPI_saveConfiguration(QSPI_Regs *qspi, DL_QSPI_backupConfig *ptr);

/**
 *  @brief      Restore QSPI configuration after leaving a power loss state.
 *
 *  Some MSPM33 peripherals residing in PD1 domain do not retain register
 *  contents when entering STOP or STANDBY modes. Please refer to the datasheet
 *  for the full list of peripheral instances that exhibit this behavior.
 *
 *  @param[in]  qspi  Pointer to the register overlay for the peripheral
 *
 *  @param[in]  ptr   Configuration backup setup structure. See
 *                    @ref DL_QSPI_backupConfig.
 *
 *  @retval     FALSE if a configuration does not exist in ptr (will not be
 *              loaded). TRUE if a configuration successfully loaded
 *
 *  @sa         DL_QSPI_saveConfiguration
 */
bool DL_QSPI_restoreConfiguration(QSPI_Regs *qspi, DL_QSPI_backupConfig *ptr);


/**
 *  @brief      Selects which port is used for QSPI memory access
 *
 *  This API selects which port is used for QSPI memory access.
 *
 *  @param[in]  qspi           Pointer to the register overlay for the
 *                            peripheral
 *  @param[in]  port           Port selection
 */
__STATIC_INLINE void DL_QSPI_setPort(QSPI_Regs *qspi, DL_QSPI_PORT port)
{
    DL_Common_updateReg(&qspi->IPSPECIFIC_QSPI.QSPICTL0, port, QSPI_QSPICTL0_QSPIMODE_MASK);
}


/**
 *  @brief      Enables the performance mode byte insertion
 *
 *  This API enables the performance mode byte insertion
 *
 *  @param[in]  qspi           Pointer to the register overlay for the
 *                            peripheral
 */
__STATIC_INLINE void DL_QSPI_enablePerformanceMode(QSPI_Regs *qspi)
{
    qspi->IPSPECIFIC_QSPI.QSPICTL0 |= QSPI_QSPICTL0_QSPIPERFMODE_ENABLE;
}


/**
 *  @brief      Disables the performance mode byte insertion
 *
 *  This API disables the performance mode byte insertion.
 *
 *  @param[in]  qspi           Pointer to the register overlay for the
 *                            peripheral
 */
__STATIC_INLINE void DL_QSPI_disablePerformanceMode(QSPI_Regs *qspi)
{
    /* Clear the QSPI performance mode bit */
    qspi->IPSPECIFIC_QSPI.QSPICTL0 &= ~QSPI_QSPICTL0_QSPIPERFMODE_ENABLE;
}

/**
 *  @brief      Sets the number of address byte
 *
 *   Sets the number of address byte to be used for communication with QSPI flash during a data read
 *
 *  @param[in]  qspi           Pointer to the register overlay for the
 *                            peripheral
 *  @param[in]  addressMode    Address mode. One of @ref DL_QSPI_ADDRESS_MODE
 */
__STATIC_INLINE void DL_QSPI_setAddressMode(QSPI_Regs *qspi, DL_QSPI_ADDRESS_MODE addressMode)
{
    DL_Common_updateReg(&qspi->IPSPECIFIC_QSPI.QSPICTL0, addressMode, QSPI_QSPICTL0_QSPIADDRMODE_MASK);
}



/**
 * @brief Set the bus format
 *
 * This function sets the bus format used for QSPI communications.
 *
 * @param qspi    Pointer to the register overlay for the peripheral
 * @param busFormat  Bus format. One of @ref DL_QSPI_BUS_FORMAT
 *
 */
__STATIC_INLINE void DL_QSPI_setBusFormat(QSPI_Regs *qspi, DL_QSPI_BUS_FORMAT busFormat)
{
    DL_Common_updateReg(&qspi->IPSPECIFIC_QSPI.QSPICTL0, busFormat, QSPI_QSPICTL0_QSPIFORMAT_MASK);
}


/**
 * @brief Provide the performance byte to be used during a flash read
 *
 * This function sets the performance byte to be used for communication with QSPI flash during a data read
 *
 * @param qspi          Pointer to the register overlay for the peripheral
 * @param performanceByte    Performance byte. The value of this byte is used to configure the number of dummy clock cycles.
 *
 * @note The default value of the QSPIPERFBYTE field is 0.
 */
__STATIC_INLINE void DL_QSPI_setPerformanceByte(QSPI_Regs *qspi, uint32_t performanceByte)
{
    DL_Common_updateReg(&qspi->IPSPECIFIC_QSPI.QSPICTL0, performanceByte << QSPI_QSPICTL0_QSPIPERFBYTE_OFS
    , QSPI_QSPICTL0_QSPIPERFBYTE_MASK);
}


/**
 * @brief Provides the instruction opcode to be used during a flash read
 *
 * This function provides the instruction opcode to be used during a flash read
 *
 * @param qspi          Pointer to the register overlay for the peripheral
 * @param commandByte   Command byte. The value of this byte is used to configure the QSPI module to send the
 *                       specified command during data transfer.
 *
 * @note The default value of the QSPICMDBYTE field is 0.
 */
__STATIC_INLINE void DL_QSPI_setCommandByte(QSPI_Regs *qspi, uint32_t commandByte)
{
    DL_Common_updateReg(&qspi->IPSPECIFIC_QSPI.QSPICTL0, commandByte << QSPI_QSPICTL0_QSPICMDBYTE_OFS
    , QSPI_QSPICTL0_QSPICMDBYTE_MASK);
}

/**
 * @brief Set the word size
 *
 * Set the size of the word used for communication with QSPI flash during a data read
 *
 * @param qspi          Pointer to the register overlay for the peripheral
 * @param size          Word size. The value of this parameter is used to configure the number of bits used
 *                       in a transfer.
 *
 * @note The default value of the QSPIDSIZE field is QSPI_QSPICTL0_QSPIDSIZE__8BITDSIZE.
 */
__STATIC_INLINE void DL_QSPI_setWordSize(QSPI_Regs *qspi, DL_QSPI_WORD_SIZE size)
{
    DL_Common_updateReg(&qspi->IPSPECIFIC_QSPI.QSPICTL0, size, QSPI_QSPICTL0_QSPIDSIZE_MASK);
}



/**
 * @brief Set the number of dummy clock cycles
 *
 * Set the number of dummy clock cycles to be used during a flash read.
 *
 * @param qspi          Pointer to the register overlay for the peripheral
 * @param numDummyClock Number of dummy clock cycles. 
 *
 * @note The default value of the QSPIDUMMYCLK field is 0.
 */
__STATIC_INLINE void DL_QSPI_setDummyClock(QSPI_Regs *qspi, uint32_t numDummyClock)
{
    DL_Common_updateReg(&qspi->IPSPECIFIC_QSPI.QSPICTL0, numDummyClock << QSPI_QSPICTL0_QSPIDUMMYCLK_OFS
    , QSPI_QSPICTL0_QSPIDUMMYCLK_MASK);
}


/**
 * @brief Enable QSPI prefetch
 *
 * Enable the prefetch feature of the QSPI.
 *
 * @param qspi  Pointer to the register overlay for the peripheral
 *
 */
__STATIC_INLINE void DL_QSPI_enablePreFetch(QSPI_Regs *qspi)
{
    qspi->IPSPECIFIC_QSPI.QSPICTL1 |= QSPI_QSPICTL1_QSPIPREFETCH_ENABLE;
}

/**
 * @brief Disable QSPI prefetch
 *
 * Disable the prefetch feature of the QSPI.
 *
 * @param qspi          Pointer to the register overlay for the peripheral
 *
 */
__STATIC_INLINE void DL_QSPI_disablePreFetch(QSPI_Regs *qspi)
{
    /* Disable prefetch feature of the QSPI */
    qspi->IPSPECIFIC_QSPI.QSPICTL1 &= ~QSPI_QSPICTL1_QSPIPREFETCH_ENABLE;
}


/**
 * @brief Contains the number of receive bytes to write to the TXFIFO when QSPIPREFETCH is enabled
 *
 * Contains the number of receive bytes to write to the TXFIFO when QSPIPREFETCH is enabled
 *
 * @param qspi          Pointer to the register overlay for the peripheral
 * @param RXByteCount   Number of bytes to receive
 *
 * @note The default value of the RXCOUNT field is 0.
 */
__STATIC_INLINE void DL_QSPI_setRXCount(QSPI_Regs *qspi, uint32_t RXByteCount)
{
    DL_Common_updateReg(&qspi->IPSPECIFIC_QSPI.QSPICTL1, RXByteCount << QSPI_QSPICTL1_RXCOUNT_OFS,
        QSPI_QSPICTL1_RXCOUNT_MASK);
}


/**
 * @brief Controls the number of transmit bytes to send during a configuration or status frame.
 *
 * Controls the number of transmit bytes to send during a configuration or status frame
 *
 * @param qspi          Pointer to the register overlay for the peripheral
 * @param TXByteCount   Number of bytes to transmit
 *
 * @note The default value of the TXCOUNT field is 0.
 */
__STATIC_INLINE void DL_QSPI_setTXCount(QSPI_Regs *qspi, uint32_t TXByteCount)
{
    DL_Common_updateReg(&qspi->IPSPECIFIC_QSPI.QSPICTL1, TXByteCount << QSPI_QSPICTL1_TXCOUNT_OFS,
        QSPI_QSPICTL1_TXCOUNT_MASK);
}


/**
 * @brief Set the number of bus clock cycles to hold the chip select high
 *
 * When in performance mode, the parameter provides the number of bus clocks for which the CS shall be 
 * high when an address change is detected
 *
 * @param qspi          Pointer to the register overlay for the peripheral
 * @param numBusClock   Number of bus clock cycles to hold the chip select high
 *
 * @note The default value of the CSHIGHTIME field is 0.
 */
__STATIC_INLINE void DL_QSPI_setChipSelectHighTime(QSPI_Regs *qspi, uint32_t numBusClock)
{
    DL_Common_updateReg(&qspi->IPSPECIFIC_QSPI.QSPITIMING, numBusClock << QSPI_QSPITIMING_CSHIGHTIME_OFS,
        QSPI_QSPITIMING_CSHIGHTIME_MASK);
}


/**
 * @brief Controls the delay in internal SCLK to sample data.
 *
 * Controls the delay in internal SCLK to sample data.
 *
 * @param qspi          Pointer to the register overlay for the peripheral
 * @param delay         Delay in SCLK cycles
 *
 * @note The default value of the DATASAMPLDLY field is DL_QSPI_DATA_SAMPLE_DELAY_0.
 */
__STATIC_INLINE void DL_QSPI_setDataSampleDelay(QSPI_Regs *qspi, DL_QSPI_DATA_SAMPLE_DELAY delay)
{
    DL_Common_updateReg(&qspi->IPSPECIFIC_QSPI.QSPITIMING, delay,
        QSPI_QSPITIMING_DATASAMPLDLY_MASK);
}



/**
 * @brief Controls the number of serial clock edge after chip select is asserted to start the SCLK
 *
 * controls the number of serial clock edge after chip select is asserted to start the SCLK
 *
 * @param qspi          Pointer to the register overlay for the peripheral
 * @param delay         Delay in SCLK cycles
 *
 * @note The default value of the CSASSERTDLY field is DL_QSPI_CHIP_SELECT_ASSERT_DELAY_0P5.
 */
__STATIC_INLINE void DL_QSPI_setChipSelectAssertDelay(QSPI_Regs *qspi, DL_QSPI_CHIP_SELECT_ASSERT_DELAY delay)
{
    DL_Common_updateReg(&qspi->IPSPECIFIC_QSPI.QSPITIMING, delay,
        QSPI_QSPITIMING_CSASSERTDLY_MASK);
}


/**
 * @brief Controls the number of serial clock edge after last SCLK to deassert the chip select
 *
 * controls the number of serial clock edge after last SCLK to deassert the chip select
 *
 * @param qspi          Pointer to the register overlay for the peripheral
 * @param delay         Delay in SCLK cycles
 *
 * @note The default value of the CSDEASSERTDLY field is DL_QSPI_CHIP_SELECT_DEASSERT_DELAY_0P5.
 */
__STATIC_INLINE void DL_QSPI_setChipSelectDeAssertDelay(QSPI_Regs *qspi, DL_QSPI_CHIP_SELECT_DEASSERT_DELAY delay)
{
    DL_Common_updateReg(&qspi->IPSPECIFIC_QSPI.QSPITIMING, delay,
        QSPI_QSPITIMING_CSDEASSERTDLY_MASK);
}


/**
 * @brief Flushes the TX FIFO
 *
 * Flushes the TX FIFO
 *
 * @param qspi    Pointer to the QSPI peripheral register overlay
 */
__STATIC_INLINE void DL_QSPI_flushTXFIFO(QSPI_Regs *qspi)
{
    qspi->IPSPECIFIC_QSPI.QSPIFIFOCTL |= QSPI_QSPIFIFOCTL_TXFIFOFLUSH_CLEAR;
}


/**
 * @brief Flushes the RX FIFO
 *
 * Flushes the RX FIFO
 *
 * @param qspi    Pointer to the QSPI peripheral register overlay
 */
__STATIC_INLINE void DL_QSPI_flushRXFIFO(QSPI_Regs *qspi)
{
    qspi->IPSPECIFIC_QSPI.QSPIFIFOCTL |= QSPI_QSPIFIFOCTL_RXFIFOFLUSH_CLEAR;
}

/**
 * @brief Deasserts the chip select
 *
 * Controls the chip select hold feature during an active transaction when QSPIFORMAT is not 0x0
 *
 * @param qspi    Pointer to the QSPI peripheral register overlay
 *
 */
__STATIC_INLINE void DL_QSPI_deAssertChipSelect(QSPI_Regs *qspi)
{
    qspi->IPSPECIFIC_QSPI.QSPICSCTL |= (QSPI_QSPICSCTL_CSHOLDCTL_DEASSERT);
}

/**
 * @brief Checks if the chip select is de-asserted
 *
 * Checks if the chip select is de-asserted.
 *
 * @param qspi pointer to the register overlay for the peripheral
 *
 * @return Returns true if the chip select is de-asserted, false otherwise
 */
__STATIC_INLINE bool DL_QSPI_isChipSelectDeAsserted(QSPI_Regs *qspi)
{
    return ((qspi->IPSPECIFIC_QSPI.QSPICSCTL & QSPI_QSPICSCTL_CSHOLDCTL_MASK) == QSPI_QSPICSCTL_CSHOLDCTL_DEASSERT);
}



/**
 * @brief Checks if the QSPI is in idle state
 *
 * Provides the state of the QSPI controller
 *
 * @param qspi pointer to the register overlay for the peripheral
 *
 * @return Returns the idle status of the QSPI
 *
 * @retval true The QSPI is in idle state
 * @retval false The QSPI is not in idle state
 */
__STATIC_INLINE bool DL_QSPI_isQSPIIdle(QSPI_Regs *qspi)
{
    return ((qspi->IPSPECIFIC_QSPI.QSPISTATUS & QSPI_QSPISTATUS_QSPIIDLE_MASK) == QSPI_QSPISTATUS_QSPIIDLE_QSPIIDLE_IDLE);
}



/**
 * @brief Checks if the QSPI is in stall state
 *
 * The bit indicates the state of the QSPI controller during an active transaction
 *
 * @param qspi pointer to the register overlay for the peripheral
 *
 * @return Returns the stall status of the QSPI
 *
 * @retval true The QSPI is in stall state
 * @retval false The QSPI is not in stall state
 */

__STATIC_INLINE bool DL_QSPI_isQSPIStalled(QSPI_Regs *qspi)
{
    return ((qspi->IPSPECIFIC_QSPI.QSPISTATUS & QSPI_QSPISTATUS_QSPISTALL_MASK) == QSPI_QSPISTATUS_QSPISTALL_QSPISTALL_STALL);
}

/**
 * @brief Checks if the QSPI TX FIFO is full
 *
 * The bit indicates if the QSPI TX FIFO is full
 *
 * @param qspi pointer to the register overlay for the peripheral
 *
 * @return Returns the full status of the QSPI TX FIFO
 *
 * @retval true The QSPI TX FIFO is full
 * @retval false The QSPI TX FIFO is not full
 */
__STATIC_INLINE bool DL_QSPI_isQSPITXFIFOFull(QSPI_Regs *qspi)
{
    return ((qspi->IPSPECIFIC_QSPI.QSPISTATUS & QSPI_QSPISTATUS_TXFIFONF_MASK) == QSPI_QSPISTATUS_TXFIFONF_TXFIFONF_F);
}


/**
 * @brief Checks if the QSPI TX FIFO is empty
 *
 * The bit indicates if the QSPI TX FIFO is empty
 *
 * @param qspi pointer to the register overlay for the peripheral
 *
 * @return Returns the empty status of the QSPI TX FIFO
 *
 * @retval true The QSPI TX FIFO is empty
 * @retval false The QSPI TX FIFO is not empty
 */
__STATIC_INLINE bool DL_QSPI_isQSPITXFIFOEmpty(QSPI_Regs *qspi)
{
    return ((qspi->IPSPECIFIC_QSPI.QSPISTATUS & QSPI_QSPISTATUS_TXFIFOE_MASK) == QSPI_QSPISTATUS_TXFIFOE_TXFIFOE_E);
}



/**
 * @brief Checks if the QSPI RX FIFO is full
 *
 * The bit indicates if the QSPI RX FIFO is full
 *
 * @param qspi pointer to the register overlay for the peripheral
 *
 * @return Returns the full status of the QSPI RX FIFO
 *
 * @retval true The QSPI RX FIFO is full
 * @retval false The QSPI RX FIFO is not full
 */
__STATIC_INLINE bool DL_QSPI_isQSPIRXFIFOFull(QSPI_Regs *qspi)
{
    return ((qspi->IPSPECIFIC_QSPI.QSPISTATUS & QSPI_QSPISTATUS_RXFIFONF_MASK) == QSPI_QSPISTATUS_RXFIFONF_RXFIFONF_F);
}


/**
 * @brief Checks if the QSPI RX FIFO is empty
 *
 * The bit indicates if the QSPI RX FIFO is empty
 *
 * @param qspi pointer to the register overlay for the peripheral
 *
 * @return Returns the empty status of the QSPI RX FIFO
 *
 * @retval true The QSPI RX FIFO is empty
 * @retval false The QSPI RX FIFO is not empty
 *
 */
__STATIC_INLINE bool DL_QSPI_isQSPIRXFIFOEmpty(QSPI_Regs *qspi)
{
    return ((qspi->IPSPECIFIC_QSPI.QSPISTATUS & QSPI_QSPISTATUS_RXFIFOE_MASK) == QSPI_QSPISTATUS_RXFIFOE_RXFIFOE_E);
}



#ifdef __cplusplus
}
#endif

#endif /* __MSP_HAS_QSPI__ */

#endif /* ti_dl_dl_qspi__include */
/** @}*/
